unit kb.releaseinfo.MVIDTests;

interface

uses
  {$IFDEF FPC}
    TestFramework;
  {$ELSE}
    DUnitX.TestFramework, DUnitX.DUnitCompatibility;
  {$ENDIF}

type
  TTestTMVIDRelease = class(TTestCase)
  published
    procedure TestTMVIDRelease1;
    procedure TestTMVIDRelease2;
    procedure TestTMVIDRelease3;
    procedure TestTMVIDRelease4;
    procedure TestTMVIDRelease5;
    procedure TestTMVIDRelease6;
    procedure TestTMVIDRelease7;
    procedure TestTMVIDRelease8;
    //procedure TestTMVIDRelease9; TODO: make code multidisc aware -> 2 sfv in separate dirs
    procedure TestTMVIDRelease10;
    procedure TestTMVIDRelease11;
    procedure TestTMVIDRelease12;
    procedure TestTMVIDRelease13;
    procedure TestTMVIDRelease14;
  end;

implementation

uses
  SysUtils, kb.releaseinfo, taskmvidunit;

{ TTestTMVIDRelease }

procedure TTestTMVIDRelease.TestTMVIDRelease1;
var
  fClass: TMVIDRelease;
  fSFV: String;
  fNFO: String;
  fFileCount: Integer;
  fGenres: TArray<String>;
  fVideoRegion: String;
begin
  fSFV := 'gfvid-5hzpt-480p.r00 f7020691' + #10 +
    'gfvid-5hzpt-480p.r01 7310d521' + #10 +
    'gfvid-5hzpt-480p.r02 8d258e21' + #10 +
    'gfvid-5hzpt-480p.r03 484a8ea6' + #10 +
    'gfvid-5hzpt-480p.r04 d67713a8' + #10 +
    'gfvid-5hzpt-480p.r05 ef5e1c78' + #10 +
    'gfvid-5hzpt-480p.r06 310e29e3' + #10 +
    'gfvid-5hzpt-480p.r07 79e79281' + #10 +
    'gfvid-5hzpt-480p.r08 6ec30e99' + #10 +
    'gfvid-5hzpt-480p.r09 29a07fb9' + #10 +
    'gfvid-5hzpt-480p.r10 b0953b86' + #10 +
    'gfvid-5hzpt-480p.r11 5fc71fe5' + #10 +
    'gfvid-5hzpt-480p.r12 16888b7a' + #10 +
    'gfvid-5hzpt-480p.r13 3b738763' + #10 +
    'gfvid-5hzpt-480p.r14 59af67a8' + #10 +
    'gfvid-5hzpt-480p.r15 132d8ba5' + #10 +
    'gfvid-5hzpt-480p.r16 dabac728' + #10 +
    'gfvid-5hzpt-480p.r17 afa94f3e' + #10 +
    'gfvid-5hzpt-480p.r18 cd495a5f' + #10 +
    'gfvid-5hzpt-480p.r19 cc58b0cb' + #10 +
    'gfvid-5hzpt-480p.r20 2ea2a553' + #10 +
    'gfvid-5hzpt-480p.r21 4c58c6f7' + #10 +
    'gfvid-5hzpt-480p.rar 3c6bac5a';

  fNFO := 'GENERAL INFO' + #10 +
    'TITLE:           The Big 3 Palladium Orchestra - Live At 39th Internationale Jazzwoche Burghausen                            ' + #10 +
    'TV DATE:         2020-02-16' + #10 +
    'x264 DATE:       2020-02-23       ' + #10 +
    'SHOW DATE:       2008-03-07     ' + #10 +
    'RUNTIME:         01:11:31          ' + #10 +
    'GENRE:           Latin            ' + #10 +
    'SUBGENRE:        Mambo, Salsa                                                  ' + #10 +
    'LANGUAGE:        spanish        ' + #10 +
    'SUBS:            [ ]eng [ ]ger [ ]fr ' + #10 +
    'SIZE:            1059,73 mb                               ' + #10 +
    'ARCHIVES:        23*50 mb          ' + #10 +
    'CHAPTERS:        [ ]          ' + #10 +
    'DEINTERLACE:     [ ] yadifmod2 [ ] selecteven' + #10 +
    ' VIDEO' + #10 +
    'SOURCE:          DVBS2            ' + #10 +
    'CODEC:           x264 159 r2991 1771b55                                          ' + #10 +
    'BITRATE:         --crf 18  1 620.53 kb/s                                         ' + #10 +
    'SPECT:           720 x 408 (1.76) at 50.00 fps                                   ' + #10 +
    '                                                                                 ' + #10 +
    'AUDIO:           AC3 Audio at 448 kb/s (untouched)                               ' + #10 +
    'INFOS:           6 channels, 48.0 kHz                                            ' + #10 +
    '                                                                                 ' + #10 +
    ' FASHION' + #10 +
    'IMDBLINK:        -                                                            ' + #10 +
    'IMDBRATING:      -             ' + #10 +
    'WEB:             https://www.discogs.com/de/artist/355601-Tito-Puente-Jr                                                                                        ' + #10 +
    ' TRACKLIST                                         ' + #10 +
    ' ' + #10 +
    ' ' + #10 +
    '			' + #10 +
    ' NOTES' + #10 +
    'The Big 3 Palladium Orchestra - Live @ 39th Internationale Jazzwoche          ' + #10 +
    'Burghausen                                                                    ' + #10 +
    '                                                                              ' + #10 +
    'Mario Machito Jr.      timbales, voc   Tito Rodriguez Jr.     timbales        ' + #10 +
    'Hector Colon Jr.       tp              Larry Moses            tp              ' + #10 +
    'Guido Gonzales         tp              Joe Giorgianni         tp              ' + #10 +
    'Wilfredo de la Torre   as              Al Acosta              as, fl          ' + #10 +
    'Jorge Castro           ts              Carmen Laboy           brs             ' + #10 +
    'Gilberto Colon Jr.     p               Guillermo Edgehill     b               ' + #10 +
    'Chembo Corniel         conga           Jimmy Delgado          bongo           ' + #10 +
    'Sammy Gonzales         voc             Ray Viera              voc             ' + #10 +
    '                                                                              ' + #10 +
    '                                                                              ' + #10 +
    'Recorded on 2008, 7th March - Live At 39th Internationale Jazzwoche           ' + #10 +
    'Burghausen, Wackerhalle (Germany)                                             ' + #10 +
    '                                                                              ' + #10 +
    'Director: Hans-Klaus Petsch                                                   ';

  fFileCount := TPazoMVIDTask.GetFileCountFromSFV(fSFV);
  fGenres := TPazoMVIDTask.TryToParseGenre(fNFO);
  fVideoRegion := TPazoMVIDTask.ParseVideoRegion(fNFO);

  fClass := TMVIDRelease.Create('The_Big_3_Palladium_Orchestra-Live_At_39th_Internationale_Jazzwoche_Burghausen_(2008-03-07)-ES-x264-2008-gFViD', 'MVID');
  try
    fClass.SetValuesFromTask(fFileCount, (fVideoRegion = 'PAL'), (fVideoRegion = 'NTSC'), fGenres);

    CheckEquals(23, fClass.mvidfiles, 'Filecount mismatch');
    CheckEqualsString('Latin,Mambo,Salsa', fClass.mvidgenre.CommaText, 'genre mismatch');
    CheckFalse(fClass.mvidpal, 'PAL mismatch');
    CheckFalse(fClass.mvidntsc, 'NTSC mismatch');
    CheckFalse(fClass.mvidva, 'Various Artists mismatch');
    CheckTrue(fClass.mvidlive, 'LIVE mismatch');
    CheckEquals(2008, fClass.mvidyear, 'Year mismatch');
    CheckEqualsString('ES', fClass.mvidlanguage, 'Language mismatch');
  finally
    fClass.Free;
  end;
end;

procedure TTestTMVIDRelease.TestTMVIDRelease2;
var
  fClass: TMVIDRelease;
  fSFV: String;
  fNFO: String;
  fFileCount: Integer;
  fGenres: TArray<String>;
  fVideoRegion: String;
begin
  fSFV := 'lauv-mtv_live_(2020)-1080p-x264-2020-srpx.r00 a31a87ec' + #13#10 +
    'lauv-mtv_live_(2020)-1080p-x264-2020-srpx.r01 a160f45d' + #13#10 +
    'lauv-mtv_live_(2020)-1080p-x264-2020-srpx.r02 826177ff' + #13#10 +
    'lauv-mtv_live_(2020)-1080p-x264-2020-srpx.rar 824df105';

  fNFO := 'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ            ß    ÜÜ                            ÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ      Ü   Ü     Û°²Û                           ÿÿ' + #10 +
    'ÿÿÿÿÿÿÿ  ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ          Û Û     ßß  Ü                         ÿÿ' + #10 +
    'ÿÿÿÿÿÿ Þßÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ    ÜÜÜ    ß                  ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿ ßÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ  Û °±Û  Ü       Û     Ü     ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ  ÿÿÿÿÿÿ  Û°±²Û      Ü     Ü  Û²Û    ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ Þßÿÿÿÿÿÿ   ßßß      Û²Û        ß     ÿÿÿÿÿÿÿÿÿÿÜÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿ  ÿÿÿ ßÿÿÿÿÿÿÿ    ß   Ü    ß  Ü   Ü        ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿ Þßÿÿÿÿÿÿÿÿÿÿÿÿ           ß      ß          ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿ ßÿÿÿÿÿÿÿÿÿÿÿÿÿ ÿÜÛÛßßßßÛÛÛÛßÛÛÛÛÛÛßßßÛÛÜÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ ÿÛ²°    ²ÛÛÛ ²²ÛÛ²±  ±°°Ûÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛßÿÿ ÿ ßÛßßßßÛÛÛÛßÛÛÛÛÛÛÛßÛÛß  ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ°ÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÜÛßÿ  ÿÿÿÛ ÿÿ ²ÛÛÛÜÛÛÛÛÛÜÜÛÛÛÛ  ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ±ÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛÛÛÿÿ  ÿÿ ÛÜÜßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  ÿÿÿÿÿÿÿÿÿÿÿÿ°ÿÿÿÿÿÿ²ÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÜÛÿÿÿÿÿÿÿÿßÿÿ   ÿÜÛßÜÜÛÛÛÛÛÛÛÛÛÛÛÛ°° Û  ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿßÜÛÿÿÿÿÿÿÿÿÿÿÿ   ÿÞÛÛÛÛÛßßÛÛÛÛ°ÛÛÛ²°  ÛÿÿÿÿÿÿÿÜÿÿÿÿÿÿÿ²ÿÿÿÿÿÿÛÝÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿß Ûÿÿÿÿÿÿÿÿÿÿÿ   ÿÿßÛÛ²° ±ÛÛÛ°±ÛÛÛ±°  ÛÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÞÝÿÿÿÿÞÛÝÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÜÜÛÿÿÿÿÿÿÿÿÿÿÿ ÿ ÿÿ Û °± ±ÛÛÛ±²ÛßÛÜÜÜßÛÛÜ  ÿÿÿÿÿÿ ÿÿÿÜÿßÜÿÿÞÛÛÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÛÛÛÛÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿÿÿÛ ÿ°°²ßßÜ²ÛÛÛÛÛÜÜÛÛÛÛ  ÿÿÿÿÿÿÿÿÿÿÿÿÿÜÜÛÛß ÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿßßÿÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿÿ ÛÜÜßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  ÿÿÿÿÿÿÿÿÿÿÿÿÜÛÛßßÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿÜÛßÜÜÛÛÛÛÛÛÛÛÛÛÛÛ°° Û  ÿÿÿÿÿÿÿÿÿÿÿÿÞÛÛÝÿ²ÿÿÿÿÿÿß' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛßÜ  ÿ ÿ ÿÞÛÛÛÛÛßßÛÛÛÛ°ÛÛÛ²°  ÛÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛ²ÛÿÜßÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛÜÿßÿÿ ÿ ÿÿßÛÛÿ° ±ÛÛÛ²±ÛÛÛ±°  ÛÿÿÿÿÿÿÿÿÿÿÜÿÿÿÞÛÛÝÿÿÿÿÜÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛÿßÿÿÿ ÿÿÿÿ Û  °±±ÛÛÛ±²ßßÜÜÜÜßÛÛÜ  ÿÿÿÿÿÿÿÿÿÿÿßÛÛÜÜÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÜÜÜÛÿÿÿÿÿ ÿÿÿÿÿÛ  ±²²ßßÜÜÛÛÛÛÛÜÜÛÛÛÛ  ÿÿÿÿÿÿÿÿÿÿÜÿÿßßÛÛÛÛÛÜÜÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÛÛÛÛÛÿÿÿÿÿ ÿÿÿÿ ÛÜÜßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  ÿÿÿÿÿÿÿÿÿÿÛÿÿÿÿÿÿÿÿÿÿßÛ²' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿßßßÿÿ     ÿÿÿÜÛßÜÜÛÛÛÛÛÛÛÛÛÛÛÛ°° Û  ÿÿÿÿÿÿÿÿÿÿ²ÝÿÿÿÿÿÿÿÿÿÿÿÞÛ²' + #10 +
    'ÿÿÿÿÿÿÜÛÿÿÿÿÿÿÿÿÿÿÿ     ÿ ÿÞÛÛÛÛÛßßÛÛÛ²ÛÛÛÛ²°  ÛÿÿÿÿÿÿÿÜÜßÿÿ²ÝÿÿÿÜÿÿÿßÿÿÿÿÛÛÝ' + #10 +
    'ÿÿÿÿÿßÜÛÿÿÿÿÿÿÿÿÿÿÿ     ÿ ÿÿßÛÛ°  ±ÛÛÛ±²ÛÛÛ±°  ÛÿÿÿÿÿÿÿÿÛß ÿÿ²ÿÿÿÿÿÿÿÿÿÿÿÞÛ²' + #10 +
    'ÿÿÿÿÿß Ûÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿ° Û²   ±ÛÛÛ°±ÛÛÛÜÜÜßÛÛÜ  ÿÿÿÿ Ûÿÿÿÿ²ÜÿÿÿÿÿÿÿÿÜÛ²ß' + #10 +
    'ÿÿÿÿÿÜÜÛÿÿayl!croÿÿÛßÜ  ÿÿÿ±ÿÛ±ÿÿ ²ÛÛÛÜÛÛÛÛÛÜÜÛÛÛÛ  ÿÿÿÜÛÛÝÿÿÿÿßßÿÜÜÜÜÛÛÛÛß' + #10 +
    'ÿÿÿÿÛÛÛÛÿÿÿÿÿ  ÿÿÿÿÛÜÿß ÿÿÿÿ ÛÜÜßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  ÿÿÿÿÿßßÿÿÿÜÜÛÛÛÛ²²ÛÛÛßÿÿ Ü' + #10 +
    'ÿÿÿÿÿßßÿÿÿÿÿÿ  ÿÿÿÿÛÿßÿ ÿÿÿÜÛßÜÜÛÛÛÛÛÛÛÛÛÛÛÛ°  Û ±ÿÜÿÿÿÿÜÿÿÜÛÛ²ÛÛÛßßßßÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿ  ÿÜÜÜÛÿÿÿ ÿÿÿÞÛÛÛÛÛßßÛÛÛÛ²ÛÛÛ²°  Ûÿ²ÿÿÿÿÿÿÿÿÛÛ²±Ûß ÿÿ²ÜÿÿÿÜÛÜ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿ  ÛÛÛÛÛÿÿÿ ÿÿÿÿßÛÛ°  ±ÛÛÛ²²ÛÛÛ±° °ÛÿßÿÿÿÿÿÿÿÞÛ²±ÛÝÿÿÿÿÿ²ÛÜÿÿßÿ   Ü' + #10 +
    '°ÿÿÿÿÿÿÿÿÿÿÿÿ  ÿßßßÿÿ  ÿÿÿÿ± Û² ° ±ÛÛÛ²²ßßÜÜÜÜßÛÛÜ  ÿÿÜÿÿÛ²°°ÛÿÿÿÿÿÜÿ²ÛÜÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÛßßÿÿ          ÿÿÿÿ²ÿÛ±ÿÿ ²ßßÜ²ÛÛÛÛÛÜÜÛÛÛÛ  ÿÿÿÿÿÞÛ°²ÛÿÿÜÿÿÿÿÞÛ²ÿÿÜ' + #10 +
    ' ÿÿÿÿÿÿÿÛßÿÿÿÿÿÿ       ÿÿÿÿß ÛÜÜßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  °ÿÿÿÿÿÿÛÛ²ÛÝÿÿÿÜÿÿÞÛ²ÿÿÿ' + #10 +
    '°ÿÿÿÿÿÜÜÛÿÿÿÿÿÿÿÿÿÿ ÿÿÿÿÿ°ÿÜÛßÜÜÛÛÛÛÛÛÛÛÛÛÛß °²Û °ÿÿÿÜÿÿÜÿÿßÛ²ÛÿÿßÛß ÞÛ²ÿÿÿ  Ü' + #10 +
    '°ÿÿÿÿÛÛÛÛÿÿÿÿÿÿÿÿÿÿ ÿÿ°ÿÿÿÿÞÛÛÛÛÛßßÛÛÛÛ°ÛÛÛ° °²Ûÿ± °ÿÿ°ÿÿÿÜ  ßßÛÜ ÿÿ Û²ÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿßßÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿÿÿÿ°ÿßÛÛÿ  ±ÛÛÛ°±ÛÛÛ± °²Ûÿ²°°ÿ° °ÿ ÜÜÜÜ  Û  ÜÛßÿÿßÿÿ°  °' + #10 +
    '°ÿ°ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿÿÿÿÿ²ÿ²Û   ²ÛÛÛ°²ÛÛÛ² °²ÛÿÛ±ÿ°±  ÜÛÛ²±²ÛÜ  ß   ÿÿÿÿ' + #10 +
    '°ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ°ÿÿ ÿÿÿ°ÿÿ°²ÿ²Û ÿ ÛÛÛÛ±²ÛÛÛ² °²ÛÿÛ²°±² ÛÛ²°  °±²ÛÜ ß Ü  °ÿÿÜ  °' + #10 +
    '°°ÿÿÿÿÿ°            ÿ°ÿÿÿ°²²ÿ²Ûÿÿ Û²ÛÛ±²ÛÛÛÛ °²ÛÿÛ²±²ÛÞÛ²±     °°²ÛÜ    Ü ÿ   °' + #10 +
    '°ÿÿÿ°ÿÿÿ          ° ÿÿÿ°ÿ°²Ûÿ²Û ÿ Û²ÛÛ²²ÛÛÛÛ °²ÛÿÛÛ²ÛÛÞÛ²±°   °°±±²²ÛÜ     °  °' + #10 +
    '°ÿ°ÿ ÿÿÿ  °  °      °ÿÿ°°²²Ûÿ²Ûÿÿ Û²ÛÛ²²ÛÛÛÛ °±ÛÿÛÛÛÛÛ ÛÛ²±°°°°°°±±²²²ÛÜ  ° °' + #10 +
    '°°ÿÿÿÿÿ°       ° °  ÿ°°°±²ÛÛÿÛÛÿÿ ÛÛÛÛÛ²ÛÛÛÛ  °Û ÛßÿÜÿÜÛÜßÛ²°±°±±±²²Û²ÛÛ ± °  °' + #10 +
    '±°ÿÿ°ÿÿÿ   °  ° ° °±°±±±²ÛÛ ÞÛÛÿ ÿÛÛÛÛÛ²ÛÛÛÛ   ßÝ ÜÛßÛÛ±°ÛÜßÛ²±²±²Û²ÛÛÛÛ ²± ° ±' + #10 +
    '°±°°ÿ° ÿ°      °°°°±±²²ÛÛßÿÜÛÛÛÜ  Û²ÛÛÛÛÛÛÛÛÝ  ÜÛÜÛ²Ü°ßÛÛ±°ÛÜßÛ²Û²ÛÛÛÛÛ Ü²² ± ±' + #10 +
    '±°°°°°°ÿ ° ° °±°²±±²²ÛÛßÿÜÛÛÛÛÛÛÛÛÛ²ÛÛÛÛÛÛÛÛÛÜÛÛÛÛÛßÜßÜ°ßÛÛ±°ÛÜÛÛÛÛÛÛß ÜÛÛ²± °°' + #10 +
    '±°°±°±°°°°°°°°²±±²²ÛÛßÿÜÛÛÛÛÛÛÛÛÛ²²²ÛÛÛÛÛÛÛÛÛÛÛÛ²²ÛÛÛßÜßÜ°ßÛÛß  ßßß ÜÜÛÛÛ²±°±°±' + #10 +
    '±±°°°°°°°°°±°±±²²ÛÛß ÜÛÛÛÛÛÛÛ²²²²²²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²²ÛÛÛßÜßÜ²ßÛ ÛÛÛÛÛÛÛÛÛ²±±°°°°' + #10 +
    '±±±°°°°°°°±°±²²ÛÛßÿÜÛÛÛÛÛÛÛÛÛ²²²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ÛÛÛÛßÜÜß ÜÛ²ÛÛÛÛÛ²²±±°°°±°' + #10 +
    '²±°°±°°±°°°±²ÛÛßÿÜÛÛ²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ÛÛÛÜ ßÛÛÛÛÛÛ²ÛÛ²²±°°°°±' + #10 +
    '²±°±°°°°±²±²ÛÛ ÜÛÛÛÛ² ßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ß ±²²ÛÛÜÿÛÛ²ÛÛÛ²²±±°°±°°±' + #10 +
    '²±°°°°±°°±²ÛÛÿÜÛ²ÛÛ²      ßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ß    °±²ÛÛÜÿÛÛÛÛ²Û²±°°°°°±±' + #10 +
    '²±±°±°°±²±²Û ÜÛ²ÛÛ²  ÿÿÿ  ÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²±°  ÿ  °±²²ÛÜÿÛÛÛÛ²²²°°°°°±²' + #10 +
    'Û±°±°°°°±²Ûß Û²ÛÛ²  ÿÿÿÿÿÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²Û²Û²±°ÿÿÿÿ °±²²ÛÜÿÛ²ÛÛ²±°±°°±±²' + #10 +
    '²±²°°°±°±²Û ÛÛ²ÛÛ ÿÿÿÿÿÿÛß°²²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²Û²±°ÿÿÿÿ °±²²Û ßÛÛ²²±°°°°°±²' + #10 +
    'Û²±°±±°±²ÛÛ Û²ÛÛÝÿ  ÿÿ Ûß° °±²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²°°ÿÿÿÿ°²²ÛÛ ÛÛ²±°°°±°±±Û' + #10 +
    'Û²±±°°²±²ÛÝÞÛ²ÛÛÿÿÿÿÿ Û²  °°°²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßß²Û²±°    ±²²Û ÛÛ²²±°°°²±²²' + #10 +
    'ÛÛ²°±°°²²ÛÝÞÛÛÛÝÿÿÿÿ ÜÛ  ÿ° °±ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ    ²ÜÛÛ²±°ÿÿÿ°±²ÛÝÞÛ²±°±°°°±²Û' + #10 +
    'ÛÛ²±°²±²²ÛÿÛÛÛÛ    ÿ Û ° ° °±²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²²ÜÜÛß²ÛÛ²±° ÿ °²²ÝÞÛ²±±°°°±±²Û' + #10 +
    'Û²²²°°²²ÛÛÿÛÛÛÛÛÜ   ÛÛ     ±±ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßß ²ÜÛÛÛ²²±   °±²ÛÿÛ²²°±°°°²²Û' + #10 +
    'ÛÛ²±±°±²²ÛÿÞÛÛÛÛÛÛÛÜÛ   ° °±²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ²ÜÛÛÛÛÛÛ²±°±°±²ÛÛÿÛ²±±°°°°±²Û' + #10 +
    'ÛÛ²±²±²²ÛÛÝÞÛÛÛÛÛÛÛÛÛÛÛÜÜÜÜ²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²²²Û²²ÛÛÝÿÛ²²±°°±°±²Û' + #10 +
    'Û²Û²±±²Û²ÛÝÿÛ²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²Û²ÛÛÿÞÛÛ²²±°°°²²Û' + #10 +
    'ÛÛÛ²²²²²ÛÛÛÿßÛ²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ÛÛ²ÛÛßÿÛÛ²²±°°±°±²Û' + #10 +
    'ÛÛ²Û²²ÛÛÛ²ÛÛÿßÛ²²ÛÛÛß ÜÜÜ ßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßÿÛÛÛÛ²²±±°±±²Û' + #10 +
    'ÛÛÛÛÛ²Û²ÛÛÛÛÛ ßÛÛ²²Û Ûß ßÛ ÛÛÛÛÛÛÛßßßßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ÛÛ²ÛÛßÿÛÛÛ²ÛÛ²±²±±²ÛÛ' + #10 +
    'ÛÛÛÛ²ÛÛÛÛÛ²ÛÛÛÜÿßÛÛÝÞÛÝ Ûß ßß ÜÜÜÜÜÛÛÛÜÜÜÜ ßßßÛßßßÛÛÛÛÛ²ÛÛÛÛÛßÿÜÛÛ²ÛÛÛ²²²±±²²²Û' + #10 +
    'Û²ÛÛÛÛ²ÛÛÛÛÛÛÛÛß  ßß ÛÛÜÜÜÛÛÛÛÛÛ²²²ÛÛÛÛÛÛÛÛÛÛÜÜ ßÜÜ ßßßßÛßßÿÜÜÛÛÛÛÛÛ²ÛÛ²Û²²²²ÛÛ' + #10 +
    'ÛÛÛÛÛÛÛÛÛÛßß ÜÜÜÛÛÛÛÜÜÜÜ ßßÛ²²²ÛÛÛÛÛÛÛÛÛÛÛÛÛßßßÛÜ ßÛÛÛÛÜÜÜÜÜÜÜÜ ßßßßÛÛÛÛÛÛÛ²ÛÛÛ' + #10 +
    'ÛÛÛÛßÛÛÛßÿÜÛÛÛÛ²ÛÛÛÛÛÛ ßßÛÜ ßÛÛÛÛÛÛÛÛÛÛÛÛÛÛ     ÛÛ ßÛ²²ÛÛ²²²ÛÛÛÛÛÛÛÜÜ ßßÛÛ²ÛÛ²Û' + #10 +
    'ÛÜÛÛÛÛÛÿÜÛÛ²²²ÛÛÛÛÛÛÛÛÜÜ  ÛÛ ÛÛÛÛÛßßß  ßßÛÛÛÛÜ   ÛÛ ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßÛÜ ßÛÛÛÛÛ' + #10 +
    'ÛÛÛÛÛÛÿÜÛ²²²ÛÛÛÛÛÛÛÛÛÛÛÛÛ °ÛÝÞÛÛÛÝ °°°±²Ü ßÛÛÛÛ  °ÛÝÞÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  ßÛ ßÛÛßÛ' + #10 +
    'ÛÛÛßÛÝÿÛ²²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ±²Û ÛÛÛÛ ±²²±²²ÛÝÞÛÛÛÛ °ÛÝÞÛÛÛÛÛßßßßÛÛÛÛÛÛÜ   ßÛÿÛÛÛÛ' + #10 +
    'ÛßÛÛÛÝÞÛ²ÛÛÛÛÛÛÛß  ßÛÛÛÛÛÛ²ÛÛ ÛÛÛÛ ²²Û²ÛÛÛÛ ÛÛÛÛÛ±ÛÛ ÛÛÛÛÛÝ°±ÜÜ ßÛÛÛÛÛ°  ÛÝÞÛÛÛ' + #10 +
    'ÛÛÛÛÜÝÞ²²ÛÛÛÛÛÛÝÞÛÛÝÞÛÛÛÛÛÛÛÛÝÞÛÛÛÝÞÛ²Û²ÛÛÝÞÛÛÛÛÛ²ÛÛ ÛÛÛÛÛÝ ²²²ÛÝÞÛÛÛÛÛ  °ÝÞÜÛÛ' + #10 +
    'ÛÛßÛÛÝÞ²²ÛÛÛÛÛÛÿßÛß ÜÛÛÛÛßßß ÜÛÛÛÛÝ ÛÛÛßß ÜÛÛÛÛÛÛÛÛÝÞÛÛÛÛÛÛ ÛÛ²²ÛÿÛÛÛÛÛ± ±ÛÿÛÛÛ' + #10 +
    'Û   ÛÝÞÛ²ÛÛÛÛÛÛÛÜ  ßßß ÜÜÜÝÞÛÛÛÛÛÛÛ ß ÜÜÛÛÛÛÛÛÛÛÛÛÛÝÞÛÛÛÛÛÛ Û²ÛÛßÞÛÛÛÛÛ² ²ÛÿÛÛÛ' + #10 +
    'ÛÛÜÛÛÝÿÛÛ²ÛÛÛÛÛÛÛÛÛÜÜÜ ßßÛÛÿÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ÛÛÛÛÛÛÝÞÛßß ÜÛÛÛÛÛÛÛ ÛÝÞÛßÛ' + #10 +
    'ÛÛÛßÛÛÜ ÛÛÛÛÛÛÛÛÛÛÛÛÛÛßÛÜÜ ÿÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ÜÛÛÛÛÛÛÝÜÜÜÛÛÛÛÛÛÛÛÛÛÛÛÝÞÛÛÛ' + #10 +
    'ÛÛßßÛÛÛÜ ßßÛÛÛÛÛÛÛÛÛÛÛÛÜ²ßÛ ßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛß ÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÿÛÜÛÛ' + #10 +
    'Û    ÛßÛÛÛÜÜ ßßßÛÛÛÛÛÛÛÛÛÜßÛ ÛÛÛÛÛÛÛÛÛÛÛÛÛÛßßß ÜÜÿÛßßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÿÜÛÛßÛ' + #10 +
    'ÛÛÜÜÛÛÛÛÛßßß ÜÜÜ  ßÛÛÛÛÛÛÛ°ÛÝÞÛÛÛÛÛÛ ßÛÛÛÛÛÛÜ ßÛÝÞÛ ßÜ ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßÿÜÛÛßÛÛ' + #10 +
    'ÛÛÛßß ÜÜÜÜÛÛÛÛß ÜÛÜ ÛÛÛÛÛÛ±ÛÝÞÛÛÛÛÛÛ ÜÿÛÛÛÛÛÛÛÜÜ ßßß ÛÝÞÛ ßßÛÛÛÛÛßßßßÿÜÜÛÛÛ   Û' + #10 +
    'Ûß ÜÛÛÛÛÛÛÛÛÛÛÝßÛÛßÞÛÛÛÛÛÛ²ÛÝÞÛÛÛÛÛÛÝÞÜÿÛÛÛÛÛÛÛÛÛÛÜÜÛÛÝÞÛ ÛÜÜÜÜÜÜÜÛÛÛßÛÛÜÛÛÛÜÛÛ' + #10 +
    'Ý Ûß ßÛÛÛÛÛÛÛÛÛÜ  ÜÛÛÛÛÛÛÛÛÛÝÞÛÛÛÛÛÛÝÞÛÿßÛÛÛÛÛÛÛÛÛÛÛÛÛ ÛÝÞÛÛß ßÛÛÛÛÛ   ÛÛÛßßßÛÛ' + #10 +
    'ÝÛÝ ßÜÞÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ÛÛÛÛÛÛÞÝ ÛÛ ÛÛÛÛÛÛÛÛÛÛÛÛ ÜÛÝÞÛÛÛÜÛÛÛßÛÛÛÜÛÛÛ     Û' + #10 +
    'Ü ßÜÜß ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛß ÛÛÛÛÛÛ Û ÛÛÜ ÛÛÛÛÛÛÛÛÛÛ ÜÛÛÛ ÛÛÛÛßÛÛÛÛÛÛÛÛÜÛ     Û' + #10 +
    'ÛÛÜÜÜÜÝÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ÛÛÛÛÛÜÜÜÛÜ ÛÛÜÿßÛÛÛÛÛÛÛ ÜÛÛÛÛÝ ÛÛÛÛÛÛßÛÛßßßßÛÛÜÜÜÛÛ' + #10 +
    'ÛÜÛßÛÛÝÞÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ÜÛÛÛßßß ÜÜÜÜÛÛßÛÜÿßÛÛÛÛÝÞÛÛÛÛÛÛÜ ßÛÛÛÛÛÛ x  x ÛÛÛßÛÛ' + #10 +
    'ÛÛ   ÛÛÿßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛß ÿÛÛÛ ÜÜ ßÛßÛÛÛ   ÛÛÿÜÿßßÝÞÛÛÛÛÛÛÛÛÜÿßßÛÛ        Û   Û' + #10 +
    'ÛÛÛÜÛßÛÛÜÜ ßßßÛÛÛÛÛßßßÿÜÜÛ ÛÛÝ   Û ÛÛÛßÛÛÜÛÛÛ ÛÛÛÜÜÛÛÛßßßßßßÛÛÛÜÿÛ ßÜÜÜÜß ÛÛÜÛÛ' + #10 +
    'ÛÛÜÛÛÛÛßßÛÛÛÛÜÜÜÜÜÜÜÛÛÛÛÛÛÜ ÛÛÜÜÛÛ ÛÛÛÛÛÛÛÛÜÛ ÛÛßß   ÜÜÛÛÛß Ü ßÛÝÞÛÜ    ÜÛÛÛÛÛÛ' + #10 +
    'ÛÛÛÛÛßßÜÜßÿÜÿÿÿÿÿÿÿÿÿßÿÿ     ßßßß ÿÿÿßÿ   Ü  ÿÛÿÿÿßÜÜß ÿÜÿÿÛ  ÜÛÝ ÜÿßßßßÿßÛÛÛÛÛ' + #10 +
    'Û²²ÛÝÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ       ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿßÛÛÛßÿÿÿÿÿÿÿÿÿÿÞÛ²²Û' + #10 +
    'Û²°ÛÿÜÿÿÿArtist......: Lauv                                    ÿÿÿÿÿÿÿÿÿÿÜÿÛ°²Û' + #10 +
    'Û±°² ÿÿÿÿTrack Title.: MTV Live (2020)                           ÿÿÿÿÿÿÿÿÿ ²°±Û' + #10 +
    'Û°ÜßßÜÿÿÿGenre.......: Pop                                     ÿÿÿÿÿÿÿÿÿÿÜßßÜ°Û' + #10 +
    'Û°ßÜÜßÿÿÿYear........: 2020                                    ÿÿÿÿÿÿÿÿÿÿßÜÜß°Û' + #10 +
    'Û°°²ÿÿÿÿÿRip date....: 2020-03-17                              ÿÿÿÿÿÿÿÿÿÿÿÿ²°°Û' + #10 +
    'Û°°ÛÿÿÿÿÿLength......: 00:21:51                                ÿÿÿÿÿÿÿÿÿÿÿÿÛ°°Û' + #10 +
    'Û°°ÛÿÿÿÿÿSize........: 727 MB (4x200 MB)                        ÿÿÿÿÿÿÿÿÿÿÿÛ°°Û' + #10 +
    'Û°°Û     Resolution..: 1920x816 (AR: 2.35)                                 Û°°Û' + #10 +
    'Û°°Û     Format......: x264 PAL 25 FPS / 4172 kbps                         Û°°Û' + #10 +
    'Û°°ÛÿÿÿÿÿAudio.......: 48000Hz AC3 5.1 384kbps                 ÿÿÿÿÿÿÿÿÿÿÿÿÛ°°Û' + #10 +
    'Û°°Û °   Deinterlace.: None                                              ° Û°°Û' + #10 +
    'ÛÜ°Û ±   Video Source: DVB                                               ± Û°ÜÛ' + #10 +
    'Û°±Û ²   Audio Source: DVB                                               ² Û±°Û' + #10 +
    'Û±²Û ÛÜ                                                                 ÜÛ Û²±Û' + #10 +
    'Û²²Û ßßßßßß ß                                                      ß ßßßßß Û²±Û' + #10 +
    'Û²²Û °±²ÛÛÛÛÜ ÛÛßÜ ÛÛßß ÛÛ   ÛÛßß ÛÛßÛ ÛÛßÛ ÛÛßß ÛÛ ÛÜ Û ÛÛßß ÛÛßÛ ÜÛÛÛ²±° Û²²Û' + #10 +
    'Û²²Û     ÿÿßÛ ÛÛÜß ÛÛÜ  ÛÛ   ÛÛÜ  ÛÛÜÛ ²ÛÜÜ ÛÛÜ  ÜÜ ÛÛÛÛ ÛÛÜ  ÛÛ Û Ûßÿÿ    Û±²Û' + #10 +
    'Û²²Û    ÿÿÿÿ² ²Û Û ²ÛÜÜ ²ÛÜÜ ²ÛÜÜ ²Û Û ÜÜÜÛ ²ÛÜÜ ²Û ²Û Û ²Û   ²ÛÜÛ ²ÿÿÿÿ   Û²±Û' + #10 +
    'Û²°Ûÿ                                                                     ÿÛ°²Û' + #10 +
    'Û°±Û                                                                       Û²°Û' + #10 +
    'Û°±Û                                                                       Û²°Û' + #10 +
    'Û°±Û ±                                                                   ± Û²°Û' + #10 +
    'Û±°Û ²                                                                   ² Û°°Û' + #10 +
    'Û°±Û ÛÜ                                                                 ÜÛ Û°°Û' + #10 +
    'Û°°Û ßßßßßß ß                                                      ß ßßßßß Û±°Û' + #10 +
    'Û±°Û °±²ÛÛÛÛÛÛÛÛÛÜ ßÛÛß ÛÛßÜ ÛÛßÛ ÛÛßß ÛÛ Û ÛÛ   ÛÛ ÛÛßÛ ßÛÛß ÜÛÛÛÛÛÛÛÛ²±° Û°±Û' + #10 +
    'Û±ÜßßÜÿÿÿÿÿÿ    ßÛÿÿÛÛÿÿÛÛÜßÿÛÛÜÛÿÛÛÿÿÿÛÛÜßÿÛÛÿÿÿÜÜÿ²ÛÜÜÿÿÛÛÿÿÛßÿÿÿÿÿÿÿÿÿÜßßÜ±Û' + #10 +
    'Û°ßÜÜßÿÿÿÿÿÿ     ²ÿÿ²Ûÿÿ²ÛÿÛÿ²Û Û ²ÛÜÜ ²Û Û ²ÛÜÜ ²Û ÜÜÜÛ  ²Û  ²ÿÿÿÿÿÿÿÿÿÿßÜÜß°Û' + #10 +
    'Û°°²                                                                       ²°°Û' + #10 +
    'Û°±Û     01.                                                [00:00:00]     Û²°Û' + #10 +
    'Û±²Û °                                                                   ° Û°Ü²' + #10 +
    'Û²°Û ±                                                      [00:21:51]   ± ÛÛ Û' + #10 +
    'Û°±Û ²                                                                   ² Û°ß²' + #10 +
    'Û±²Û ÛÜ                                                                 ÜÛ Û²±Û' + #10 +
    'Û²±Û ßßßßßß ß                                                      ß ßßßßß Û²²Û' + #10 +
    'Û±²Û °±²ÛÛÛÛÛÛÛÜ ÛÛßß ÛÛßÜ ÛÛßÛ ÛÛ Û ÛÛßÜ ÛÜ Û ÛÛßß ÛÛ   Û ÛÛßÛ ÜÛÛÛÛÛÛ²±° Û²²Û' + #10 +
    'Û²±Û          ßÛ ÛÛ Û ÛÛÜß ÛÛ Û ÛÛ Û ÛÛÜÛ ÛÛßÛ ÛÛÜ  ÛÛ Ü Û ²ÛÜÜ Ûß         Û±²Û' + #10 +
    'Û²±Û           ² ²ÛÜÛ ²Û Û ²ÛÜÛ ²ÛÜÛ ²Û   ²Û Û ²ÛÜÜ ²ÛÛßÛÛ ÜÜÜÛ ²          Û±²Û' + #10 +
    'Û±²Û                                                                       Û²±Û' + #10 +
    'Û±²Û     For all other non-rock/metal genres and music videos we feel      Û±²Û' + #10 +
    'Û°²Û     that do not fit into the SRP group, SRPx!                         Û²±Û' + #10 +
    'Û±²Û                                                                       Û±°Û' + #10 +
    'Û²±Û                      Anything To Offer? Contact:                      Û±²Û' + #10 +
    'Û²ÛÛ                                                                       ÛÛ²Û' + #10 +
    'ÛÛ²Û ß                                                                   Ü Û²ÛÛ' + #10 +
    'Û²ÛÛ                            srp @ mail . az                            ÛÛ²Û' + #10 +
    'ÞÛ²ÛÝ  Ü      ÜÜÜ                                             Ü        Ü  ÞÛ²ÛÝ' + #10 +
    ' ÛÛ²ÛÝ    Ü Üß°° ßÜ Ü                       ÜÜÜ    Ü        Ü  Ü²Ü       ÞÛ²ÛÛ' + #10 +
    '  Û²Û²ÛÜÜ   Û±°   Û   ÜÜ AyLieN/cRO Ü      Û²± Û       ÜÜ v0.6  ß   ß ÜÜÛ²Û²Û' + #10 +
    '   ßÛ²ÛÛ²ÛÛÛÛÛÜÜÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ±  ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßßßÛÛÛÛÛ²ÛÛ²Ûß' + #10 +
    '     ßßÛÛÛß²ßÛÛÛÛÛÛÛÛÛÛÛÛÛßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²°   ÛÛÛÛÛÛßß' + #10 +
    '          ßÜß      ßß    Û²±Û    Ü   ß   Ü  ß    Ü      Ü   Û±°   Û   ÜÜ  Ü' + #10 +
    '        ß        Ü   ÜÜ   ßß    Û²Û             Û²Û  Ü       ßÜÜÜß Ü Û±²Û' + #10 +
    '              Ü     Û±²Û     Ü   ß     ²Û   Ü    ß       Ü  Ü         ßß' + #10 +
    '     Ü       Û²Û     ßß                                 Û²Û     Ü ²Û' + #10 +
    '              ß          Ü          ß      Ü    Ü   ß    ß             Ü' + #10 +
    '         Ü       Û² Ü   Û²Û     Ü      Ü                       ß' + #10 +
    '             Ü           ß                                  Ü      Ü' + #10 +
    '                     ß             Û²         ß       ²Û        Ü' + #10 +
    '      ß          Ü         Ü              Ü' + #10 +
    '                    Ü                             ß                     Ü' + #10 +
    '                                    ß' + #10 +
    '            Ü                                  Ü         Ü     ß' + #10 +
    '                     ß                  Ü ';

  fFileCount := TPazoMVIDTask.GetFileCountFromSFV(fSFV);
  fGenres := TPazoMVIDTask.TryToParseGenre(fNFO);
  fVideoRegion := TPazoMVIDTask.ParseVideoRegion(fNFO);

  fClass := TMVIDRelease.Create('Lauv-MTV_Live_(2020)-1080p-x264-2020-SRPx', 'MVID');
  try
    fClass.SetValuesFromTask(fFileCount, (fVideoRegion = 'PAL'), (fVideoRegion = 'NTSC'), fGenres);

    CheckEquals(4, fClass.mvidfiles, 'Filecount mismatch');
    CheckEqualsString('Pop', fClass.mvidgenre.CommaText, 'genre mismatch');
    CheckTrue(fClass.mvidpal, 'PAL mismatch');
    CheckFalse(fClass.mvidntsc, 'NTSC mismatch');
    CheckFalse(fClass.mvidva, 'Various Artists mismatch');
    CheckTrue(fClass.mvidlive, 'LIVE mismatch');
    CheckEquals(2020, fClass.mvidyear, 'Year mismatch');
    CheckEqualsString('EN', fClass.mvidlanguage, 'Language mismatch');
  finally
    fClass.Free;
  end;
end;

procedure TTestTMVIDRelease.TestTMVIDRelease3;
var
  fClass: TMVIDRelease;
  fSFV: String;
  fNFO: String;
  fFileCount: Integer;
  fGenres: TArray<String>;
  fVideoRegion: String;
begin
  fSFV := 'gfvid-jwtnz-480p.r00 38136139' + #10 +
    'gfvid-jwtnz-480p.r01 bc2218d2' + #10 +
    'gfvid-jwtnz-480p.r02 b5a82ef1' + #10 +
    'gfvid-jwtnz-480p.r03 21ba5af6' + #10 +
    'gfvid-jwtnz-480p.r04 2f92bc6f' + #10 +
    'gfvid-jwtnz-480p.r05 19490daa' + #10 +
    'gfvid-jwtnz-480p.r06 8426fc7e' + #10 +
    'gfvid-jwtnz-480p.r07 239fcf26' + #10 +
    'gfvid-jwtnz-480p.r08 4f6c3c0c' + #10 +
    'gfvid-jwtnz-480p.r09 17bffe66' + #10 +
    'gfvid-jwtnz-480p.r10 d6472920' + #10 +
    'gfvid-jwtnz-480p.r11 f2c58bac' + #10 +
    'gfvid-jwtnz-480p.r12 de7a1083' + #10 +
    'gfvid-jwtnz-480p.r13 fc98b3f9' + #10 +
    'gfvid-jwtnz-480p.r14 1b842756' + #10 +
    'gfvid-jwtnz-480p.r15 4c559982' + #10 +
    'gfvid-jwtnz-480p.r16 ae80765c' + #10 +
    'gfvid-jwtnz-480p.r17 1f8e3970' + #10 +
    'gfvid-jwtnz-480p.r18 aa8a5644' + #10 +
    'gfvid-jwtnz-480p.r19 252f7f06' + #10 +
    'gfvid-jwtnz-480p.r20 b17b3f9d' + #10 +
    'gfvid-jwtnz-480p.r21 65ea2a60' + #10 +
    'gfvid-jwtnz-480p.r22 f17b0b76' + #10 +
    'gfvid-jwtnz-480p.r23 6c49d52a' + #10 +
    'gfvid-jwtnz-480p.r24 d26ee1bd' + #10 +
    'gfvid-jwtnz-480p.r25 9010b7ed' + #10 +
    'gfvid-jwtnz-480p.r26 a95dc16d' + #10 +
    'gfvid-jwtnz-480p.r27 2f438c15' + #10 +
    'gfvid-jwtnz-480p.r28 0097cb5e' + #10 +
    'gfvid-jwtnz-480p.r29 2ff52ea3' + #10 +
    'gfvid-jwtnz-480p.r30 ed11f16a' + #10 +
    'gfvid-jwtnz-480p.r31 6c0aab7e' + #10 +
    'gfvid-jwtnz-480p.r32 6ad154f6' + #10 +
    'gfvid-jwtnz-480p.r33 9a9ddb25' + #10 +
    'gfvid-jwtnz-480p.r34 93f302a3' + #10 +
    'gfvid-jwtnz-480p.r35 68ffbf60' + #10 +
    'gfvid-jwtnz-480p.r36 a7289677' + #10 +
    'gfvid-jwtnz-480p.r37 f841b55e' + #10 +
    'gfvid-jwtnz-480p.r38 6a557985' + #10 +
    'gfvid-jwtnz-480p.r39 f9d1a866' + #10 +
    'gfvid-jwtnz-480p.r40 c2a3ad2f' + #10 +
    'gfvid-jwtnz-480p.r41 f45eeb53' + #10 +
    'gfvid-jwtnz-480p.r42 6770d7ea' + #10 +
    'gfvid-jwtnz-480p.r43 dd104b39' + #10 +
    'gfvid-jwtnz-480p.r44 92ee194b' + #10 +
    'gfvid-jwtnz-480p.r45 eecde447' + #10 +
    'gfvid-jwtnz-480p.r46 39bf3254' + #10 +
    'gfvid-jwtnz-480p.r47 aa9f9586' + #10 +
    'gfvid-jwtnz-480p.r48 cd09ba12' + #10 +
    'gfvid-jwtnz-480p.r49 92a08122' + #10 +
    'gfvid-jwtnz-480p.r50 24b4934a' + #10 +
    'gfvid-jwtnz-480p.rar f1654abc';

  fNFO := 'GENERAL INFO' + #10 +
    'TITLE:           The Living End - Live At Berlin Live                                                                        ' + #10 +
    'TV DATE:         2020-02-22' + #10 +
    'x264 DATE:       2020-02-23       ' + #10 +
    'SHOW DATE:       2018-02-18     ' + #10 +
    'RUNTIME:         00:52:16          ' + #10 +
    'GENRE:           Rock                ' + #10 +
    'SUBGENRE:        Rockabilly, Punk                                        ' + #10 +
    'LANGUAGE:        english        ' + #10 +
    'SUBS:            [ ]eng [þ]ger [ ]fr ' + #10 +
    'SIZE:            945,49 mb                               ' + #10 +
    'ARCHIVES:        52*20 mb          ' + #10 +
    'CHAPTERS:        [ ]          ' + #10 +
    'DEINTERLACE:     [ ] yadifmod2 [ ] selecteven' + #10 +
    ' VIDEO' + #10 +
    'SOURCE:          DVBT2            ' + #10 +
    'CODEC:           x264 159 r2991 1771b55                                          ' + #10 +
    'BITRATE:         --crf 19  2 335.41                                              ' + #10 +
    'SPECT:           720 x 408 (1.76) at 50.00 fps                                   ' + #10 +
    '                                                                                 ' + #10 +
    'AUDIO:           AAC LC at 192 kb/s (untouched)                                  ' + #10 +
    'INFOS:           2 channels, 48.0 kHz                                            ' + #10 +
    '                                                                                 ' + #10 +
    ' FASHION' + #10 +
    'IMDBLINK:        -                                                            ' + #10 +
    'IMDBRATING:      -             ' + #10 +
    'WEB:             https://www.thelivingend.com/                                                                                                                  ' + #10 +
    ' TRACKLIST' + #10 +
    '                                                                              ' + #10 +
    '			' + #10 +
    ' NOTES' + #10 +
    'The Living End - Live @ Berlin Live                                           ' + #10 +
    '                                                                              ' + #10 +
    'Recorded on 2018, 18th February - Live At Berlin Live, SchwuZ (Germany)       ' + #10 +
    '                                                                              ' + #10 +
    'Director: Hannes Rossacher                                                    ';

  fFileCount := TPazoMVIDTask.GetFileCountFromSFV(fSFV);
  fGenres := TPazoMVIDTask.TryToParseGenre(fNFO);
  fVideoRegion := TPazoMVIDTask.ParseVideoRegion(fNFO);

  fClass := TMVIDRelease.Create('The_Living_End-Live_At_Berlin_Live_(2018-02-18)-x264-2018-gFViD', 'MVID');
  try
    fClass.SetValuesFromTask(fFileCount, (fVideoRegion = 'PAL'), (fVideoRegion = 'NTSC'), fGenres);

    CheckEquals(52, fClass.mvidfiles, 'Filecount mismatch');
    CheckEqualsString('Punk,Rock,Rockabilly', fClass.mvidgenre.CommaText, 'genre mismatch');
    CheckFalse(fClass.mvidpal, 'PAL mismatch');
    CheckFalse(fClass.mvidntsc, 'NTSC mismatch');
    CheckFalse(fClass.mvidva, 'Various Artists mismatch');
    CheckTrue(fClass.mvidlive, 'LIVE mismatch');
    CheckEquals(2018, fClass.mvidyear, 'Year mismatch');
    CheckEqualsString('EN', fClass.mvidlanguage, 'Language mismatch');
  finally
    fClass.Free;
  end;
end;

procedure TTestTMVIDRelease.TestTMVIDRelease4;
var
  fClass: TMVIDRelease;
  fSFV: String;
  fNFO: String;
  fFileCount: Integer;
  fGenres: TArray<String>;
  fVideoRegion: String;
begin
  fSFV := 'momoiro_clover_z-hakkin_no_yoake-ja-bluray-retail-x264-2016-darkflix.mkv F2B99DFC';

  fNFO := '                                 þßþ' + #10 +
    '   ÜßßÛÛÜÜ ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ Ü  ßÜÜ  Ü ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ ÛÛÜ       ÜÛ³' + #10 +
    ' ÜÜÜÜÜ ÛÛÛ ÜÜÜÜÜÜÜÜ  ÜÜÜÜÜÜÜÜ  ÜÜ    ÛÛÛ   ÜÜÜÜÜÜÜ ÜÜÜ  ÜÜ        ÛÛÛ³     ÜÛÛ³' + #10 +
    ' ÛÛÛ³  ÛÛÛ³ÛÛÛ³  ÛÛÛ ÛÛÛ³  ÛÛÛ ÛÛÛ³ ÜÛÛÛ³ ÛÛÛÛßßÛÛ³ßß ³ÛÛÛ³       ÛÛÛÛÜ ÜÜÛÛÛÛ³' + #10 +
    ' ÛÛÛ³  ÛÛÛ³ÛÛÛßß ÛÛÛ³ÛÛÛÜÜÛßßß ÛÛÛÛÛÛßß   ÛÛÛ³     ÛÛÛ ÛÛÛ³  h!   ÛÛÛ³ßÛß ÛÛÛÛ³' + #10 +
    ' ÛÛÛ³  ÛÛÛ³ÛÛÛ³  ÛÛÛ³ÛÛÛ ßßÛÛÜ ÛÛÛ  ßÛÛÜ  ÛÛÛÛÛÛ³  ÛÛÛ³ÛÛÛ³       ÛÛÛ³ Û³ ÛÛÛÛ³' + #10 +
    ' ÛÛÛ³  ÛÛÛ³ÛÛÛ³  ÛÛÛ³ÛÛÛ³  ÛÛÛ³ÛÛÛ³  ÛÛÛ³ ÛÛÛ³ ß   ÛÛÛ³ÛÛÛ³  ÜÜÜ  ÛÛÛ³ Þ³ ÛÛÛÛ³' + #10 +
    ' ÛÛÛ³  ÛÛÛ³ÛÛÛ³  ÛÛÛ³ÛÛÛ³  ÛÛÛ³ÛÛÛ³  ÛÛÛ³ ÛÛÛ³     ÛÛÛ³ÛÛÛ³   ÛÛÛ³ÛÛÛ³ Þ³ ÛÛÛÛ³' + #10 +
    ' ÛÛÛ³  ÛÛÛ³ÛÛÛ³  ÛÛÛ³ÛÛÛ³  ÛÛÛ³ÛÛÛ³  ÛÛÛ³ ÛÛÛ³     ÛÛÛ³ÛÛÛ³   ÛÛÛ³ÛÛÛ³    ÛÛÛÛ³' + #10 +
    ' ÛÛÛ³  ÛÛÛ³ßÛÛÜ  ÛÛÛ ßÛÛ  ÜÛÛß ßÛÛ   ÛÛÛ  ßÛÛ      ßÛÛ ßÛÛÜÜÜÛÛÛÛ ÛÛÛ³   ÞÛÛÛÛ³' + #10 +
    ' ÛÛÛ³  ÛÛÛ³ Ü ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ  ÜÛß ÜÜÜ ßÜ  ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ Ü ÛÛÛ³   ÞÛÛÛÛ³' + #10 +
    ' ÛÛÛÜÜÜÛÛÛ                         ß          ß                   ßÛÛ    ÞÛÛÛÛ' + #10 +
    ' ßÛÛÛÛÛÛÛß                                                               ÞÛÛÛß' + #10 +
    '  ßÛßßß               Momoiro Clover Z Hakkin no Yoake                  ÞÛß' + #10 +
    ' Ü ß  ÜÜ                                                            ÜÜ   Û þþþ±' + #10 +
    '   °   ßßßßßßßßßßßßßßßßßßßÛÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÛßßßßßßßßßßßßßßßßßßß    ßþ  ß' + #10 +
    '     ß ßßßÛÛÛ ß ßßß²ÛÛÛ ß Ü     Û Ü ÜÜÜÜÜÜÜÛÜ ÜÜÜÜÜÜ ß ßßßßßß ß ßßßß²ÛÛÛßßß ß' + #10 +
    '   ° ²ÛÛ ²ÛÛÜ ²ÛÛß ÜÜÜÜ ²ÛÛ  ÜÜÜß ÜÜÜÜ  ßßßÛÜÜÜÜ²ÛÛÛ ßßßßß²ÛÛÛ ²ÛÛß ÜÜÜÜ  °' + #10 +
    '   ± ßßß ßßßß ßßßßßßßßß ²ÛÛÜÜ²ÛÛÛ ²ÛÛÜÜ²ÛÛÛÛ²ÛÛ ²ÛÛÛ ßßßßßßßßß ßßßßßßßßß  ±' + #10 +
    '   ²ßßßßßßßßßßßßßßßßÛÛ² Ü ÜÜÜÜÜÜÜ         Üß   ÜÜÜÜÜÜ Ü ²ÛÛßßßßßßßßßßßß ßß²' + #10 +
    '   ß  TECHNiCAL     Üß±          ßþÜÜÜÜÜÜß Üþßß         ±ß Ü  iNFORMATiON ß' + #10 +
    '   Û              ß   °              ÜÜ ßÜß             °                 Û' + #10 +
    '   ²ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ ²' + #10 +
    '   ²                                                                    Þ ²' + #10 +
    '   ² Rls.info..: 2018.03.11, Music, JPOP, 6mn 10s @ 270 MiB             Þ ²' + #10 +
    '   ² Video.....: x264, 720x400, 1.77 AR, 23.976fps, 2 Pass, @ 5878 Kbps Þ ²' + #10 +
    '   ² Video.SRC.: Bluray From Limited Edition \"Hakkin_no_Yoake\" CD       Þ ²' + #10 +
    '   ² Video.iVTC: None, Source was 23.976 Progressive already.           Þ ²' + #10 +
    '   ² Audio.....: MP3, 2 Channels @ 240 Kbps VBR                         Þ ²' + #10 +
    '   ² Audio.SRC.: Momoiro_Clover_Z-Hakkin_no_Yoake-CDA-JP-2016-DARKAUDiO Þ ²' + #10 +
    '   ±                                                                    Þ ±' + #10 +
    '   ±ßßßÛÞßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßÛßßßßßßß ±' + #10 +
    '   ²þÞßÛÞÜÜÜ ÜÜÜÜÜÜÜÜÜÜÜ              ! M O R E !    ÛÛßßßßßßßßß Û ßßßßßßß²' + #10 +
    '   ²ÜÜÜÛÞÛ°ßÝ°°ÛÜ      ßßßßßßßÜ                     ²ÛÝÜÜÜÜÜÜÜÜÜÜ²ÜÜÜÜÜÜÜÜ²' + #10 +
    '   ²°°²±Þ°°²Ý°°°ÛÜÜ  N E X T   ßþÜÜ   ! i N F O !   ÛÛÝ          Þ±Û±±ÛÛ²°±' + #10 +
    '   ±°°²±Þ°°²Ý°°°±±²ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÞÛÜÜÜÜÜÜÜÜÜÜÛÛÛÛ±ÛÛ²°±' + #10 +
    '   ±ÜÜÜÜÞÜÜ²Ý°°°±±±²²²²²ÛÛ  ********** p L o T **** Û            Þ±Û±±ÛÛ²°±' + #10 +
    '   °Ü   Þ   +°°°±±±²²²²²ÛÛÛ  iMDB, riPpeR/gRp nOteS Û   E T C ! !Þ±±±±ÛÛ²°±' + #10 +
    '   °±±²²²±ÛÛ²+°°±±±²²²²²ÛÛÛÛÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÛÜÜÜÜÜÜÜÜÜÜÜÜÛÛÛÛÛÛÛÛ²±' + #10 +
    '   °ÛßÛßÞ++Û±Ý³++³+++++++++++++++++++++++++++++++++++++++++++++++++++++++Þ±' + #10 +
    '   °Ý Û Þþ+Ü±Ý³Þ ³                                                        ±' + #10 +
    '   °Ý Û Þþ+Ü±Ý³Þ ³ Momoiro Clover Z''s Music Video For Hakkin no Yoake.    ±' + #10 +
    '   °Ý ² Þþ+Ü°Ý³Þ°³                                                        ±' + #10 +
    '   Ûþ Û ÞÜßÛÛßßßßÛÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ           ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÛ²Ûßßß ß ÝþþþþÛ' + #10 +
    '   ²þÞ°ÝÞ °ÛÝ°°ÞÜ³ÜÜÜÜÜ ÜÜÜÜÜÜÜÜ ßßßßßßßßßßßßß       °        °  °ÞßßÝÜÜÜþ²' + #10 +
    '   ²þÞ°ÛÞ  ÛÝ°°°Ü³ÜÜ²ÛÛ ÜÜÜÜÜÛÛß ß ßßÛÛÛÛ ß²ÛÛÛ  ÛÛ ß ßßß²ÛÛÛß³ß  Þ ÝÝÝÜÞþ²' + #10 +
    '   ²þÞ±ÛÞ° ÛÝ°°°ÝÜ²²²ÛÛ ²ÛÛÜÜ²ÛÛ ²ÛÛ ²ÛÛÛ  ²ÛÛÛÜ ÛÛ      ²ÛÛÛ ³  °Þ  ÝÝÞÞþ²' + #10 +
    '   ²þÞ²ÛÞ ÜÛÝÜÜÜÜÜÜÜÜÜÜÜßßßßßßßß ßßßßßßßß° ßßßßßßßß ²    ßßßß ³  ±ÞÜÝÝßßÞþ²' + #10 +
    '   ²þÞ²ÛÛÜÛ²Ý°°ÛÜ      ßßßßßßßÜ             Üßßßß ß²ÛÛÜÜÜÜÜÜÜÜ³ÜÜ²Ü  ßßßßþ²' + #10 +
    '   ²þÞÛ°Þ²²²Ý°°°ÛÜÜ WHAT WE R  ßþÜ ABOUT Üþß AS GRP ²ÛÛÜÜÜÜÜÜÜ³ÜÜÛÛÜÜÜÜÜÜÛ²' + #10 +
    '   ±þÞÛ°Þ²²²Ý°°°±±²ÜÜÜÜÜÜÜÜÜÜÜÜÜÜþþÜ ÜßÜÛÜÜÜÜÜÜÜÜÜÜþ±±³±³±³±³±³±³±³±³±³±³ÛÛ' + #10 +
    '   ±þÞÛ±Þ²²²Ý°°°±±±²²²²²ÛÛ  tHis iS hUmblE n CHiLL  ±ÛÁÛÁÛÁÛÁÛÁÛÁÛÁÛÁÛÁÛÁÛÛ' + #10 +
    '   °ÜÛÛ²Þ²²²+°°°±±±²²²²²ÛÛÛ SECTiON oF dArkSiDeRs!  °ÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄÛ' + #10 +
    '   °±±²²²²²² +°°±±±²²²²²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²²' + #10 +
    '   °ßßÛßßßßÛ  ''++³++++++++++++++++++++++++++++++++++++++++++++++++++++++++±' + #10 +
    '   ±  Ü ÛÛ Û  ³  *                                            ³           °' + #10 +
    '   ±  Û ÛÛ ÛDARKS³D E R S <:> aRe StiLL cHiLLn, StiLL pRe fOLdeR fiLLin!! ±' + #10 +
    '   ±  ÛÜÜÜÜÛÜÜ³ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ³ÜÜÜÜÜÜÜÜÜÜ²²' + #10 +
    '   ²       °  ³                                               ³           ²' + #10 +
    '   ² iDENT: DARKSTARS, LoCaTiOn: Neo-KoBe,  YeAr: 2 0 1 8 of CyBeR-pUnk 0 ²' + #10 +
    '   ÛßßßßßßßÛßß³ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßÛ' + #10 +
    '   Û       ²  ³  ³                                            ³           ²' + #10 +
    '   Û WE R  °þþ³þþ³ DARKSiDERS ''18 - TV/MoViE SeCtiOn iS bOrN! ³ LOYALTY   ±' + #10 +
    '   Û ONLY  °þ:³:þ³ DFLiX iS MOstLY aBouT rEaL CaPs and ReTaiL ³ TRUTH,    °' + #10 +
    '   Û LIKE  ²þ:³:þ³                                            ³ TRUST.... °' + #10 +
    '   Û  1O   ±þ:³:þ³ nEw sMaLL gRouP tRyinG tO dOmiNaTe? WeLL.. ³ MUTUAL    ±' + #10 +
    '   Û ACTiV ±þ:³:þ³ oFC wE aRe! wErE aLsO hErE tO shOw HowS    ³ RESPECT   ±' + #10 +
    '   Û MtiV8 ±þ:³:þ³ aLSo rAgTaG BanDit GRouP hAS pOsSibiLitY!  ³ FAMiLY!   ±' + #10 +
    '   ² DOiNG ²þ:³:þ³                                            ³ FRiENDSHiP²' + #10 +
    '   ² MOST! ²þ:³:þ³ We ALvAyS PrEfeR RETAiL oVeR wEb! QuAliTy  ³           ²' + #10 +
    '   ±ÜÜÜÜÜÜÜÛþ:³:þ³ rAtHeR tHeN qUanTity!! wE HopE ThAt wE dO  ³ WE ARE DA Û' + #10 +
    '   °°°²°ÞÞ±Ûþ:³:þ³ GeT biT mOrE WelcOmE tHeN oUr mAin gAmEs!! ³  REBELS   Û' + #10 +
    '   ±°°Û°ÞÞ±Ûþ:³:þ³                                            ³           Û' + #10 +
    '   ±°°Û°ÞÞ±Ûþþþþþ³-----------------------------------ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿ Û' + #10 +
    '   ²°°Û°ÞÞ±ÛÛÛÛÛÛ³Û        DARKSiDERS FAMiLY iS:    ±               ÚÄ¿ ³ ±' + #10 +
    '   ²°°Ü°ÞÞ±Ûþþþþþ³ßÛÛÛÛÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÛßßÛÜÜ ÜÜÜ-----ÄÅÄÙ ³ ²' + #10 +
    '   Û°°Ü°ÞÞ±Ûþ:³:þ³                                  °         ³     ÀÄÄÄÙ Û' + #10 +
    '  ÛÛÛÛ²ßßß±Ûþ:³:þ³ DARKSiDERS(GAMES & 0DAY) - dbOOk(EBOOKS)   ³ -     ÜÜÜÜÛ' + #10 +
    '  ²±þ±ÛÜÞ±±Ûþ:³:þ³ DARKAUDiO(MUSiC) - DARKFLiX (TV AND MOViES)³-    ÜÜ²ÜÜ' + #10 +
    '  ²±±±±ÞÛ±±Ûþþ³:þþ         - JAVSiDERS (JAV XXX) -            ³     ±   Þ' + #10 +
    '  ²²²²²ÞÛßßÛÜÜ³þþ³                                            ³ÜÜÛßß²ßßßÞÛÛÛ' + #10 +
    '  °°°°²ÞÛ  ³ ß³ßß³ÜÜÜÜÜÜÜÜÜÜÜÜ                 ÜÜÜÜÜÜÜÜÜÜÜÜÜßß³ß    ²ÜÜÜÞ²Þ²' + #10 +
    '  Þ±±±°ÞÛ ÜÜÜÜ³ÜÜÜÜ Ü ÜÜÜÜÜÜ ßßßßßßßßßßßßßßßßßßß Ü³ÜÜÜÜÜÜ Ü ÜÜ³ÜÜÜÜ °ÜÜÜÛ°Þ²' + #10 +
    '  Þ±±±°ÞÛ ÜÜÜ ÜÜÜÜÜ ÜÜÜÜ²ÛÛß ß ßßßßßßß ß ßßßßßßß  ³  ²ÛÛÛ ÜÜÜÜÜÜÜÜÜ ÛÛÛÝÜ°Þ±' + #10 +
    '  Þ±±±°ÞÛ ²ÛÛÜÜ²ÛÛÛ ²ÛÛ ²ÛÛÛ ²ÛÛß ÜÜÜÜ ²ÛÛß ÜÜÜÜ  °  ²ÛÛÛ ÜÜÜÜ³²ÛÛÛ °Û°Ý°ÛÞ±' + #10 +
    '  Þ°±±°ÞÛÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ ßßßßßßßßß ßßßßßßßßß  ³ÜÜ         ³     ±Û°ßß°Þ±Ý' + #10 +
    '  Þ°±±°Þß        .      ÞÛÛ²ÞßßßßßßßÝ±Ûß±ÛßßßÛßÛßÛ³²ÛÛßßßßßßßß³ßßßßß²ßßßßÝÞ°Ý' + #10 +
    '  Þ°±±±Þ    DARKS³DERS  Þ°²±ÞþÜßþÜßþÜ±ÛÜ±ÝßþÜ± ± ±³±ß±ß±³±³±³±³±³±³±±ÞßÛ°ÝÞ°Ý' + #10 +
    '  Þ°±±±ÞÜÜÜÜÜÜÜÜÜ³ÜÜÜÜÜÜÛÜÜÛÞÜÜÜÜÜÜÜÜÜÜÜÜÜÛÛÁÛÁÛÁÛÁ°ÁÛÁÛÁÛÁÛÁÛÁÛÁÛÁÛ±Þ°Ü°ÝÞ°Ý' + #10 +
    '  Þ°±±Ü°Ý  ³  ³  ÀþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄþÄ±ÞÜÜÜÝÞ°Ý' + #10 +
    '  Þ°±°Ýß   ³  ³                                               ³     ±ÞÜÜÜÜÛ°Ý' + #10 +
    '  Þ°±ß     ³  ³                                               ³     ²ÞÜÜ  Þ°Ý' + #10 +
    '  Þ²  - CRD³- BEAN - DARKAUDiO - PRESCRiPTiON - KNOW - JAVSiDERS -  ²ÞÜÜÜÜÛ°Ý' + #10 +
    '  Þ²       ³  ³ - dbOOK - ANiHLS - ANiURL - AEROHOLiCS -      ³     ²ÞÜ   Þ°Ý' + #10 +
    '  Þ°       ³  ³          - REGRET - LoKET - wAx -             ³     ÛÞÜÜÜÜÛ°Ý' + #10 +
    '  Þ°       ³  ³                                               ³     ÛÞÜ   Þ°Ý' + #10 +
    '  Þ°       ³  ³                                               ³     ÛÞÜÜÜÜÛ°Ý' + #10 +
    '  Þ±       ³  ³     - BLOCKTRONiCS - TEXTMOD.ES - TiTAN -     ³     ÛÞÜ   Þ°Ý' + #10 +
    '  Þ±ßßÜ ÜÜ ³  ³                                               ³     ÛÞÜÜÜÜÛ±Ý' + #10 +
    '  Þ±°    ßßßßÜ³ÜÜÜÜÜÜÜÜÜÜÜ                          ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÛß    °±' + #10 +
    '  Þ±  Ü ÜÜÜÜÜÜ³ Ü ÜÜÜÜÜÜ ßßßßßßßßßßßßßßßßßßßßßßßßßßßß Ü ÜÜÜÜÜÜÜ Ü ÜÜÜÜÜÜÜ Þ±' + #10 +
    '  Þ±° ÜÜÜ     ³ ÜÜÜ ²ÛÛÛ ß ßßß²ÛÛÛ ß ßßß²ÛÛÛ ß ßßÛÛÛÛ ÜÜÜ     ³      ²ÛÛÛ °²' + #10 +
    '  Þ±± ²ÛÛÜÜ²ÛÛ³ ²ÛÛÜ²ÛÛÛ ²ÛÛ  ²ÛÛÛ      ²ÛÛÛ ÛÛÛß²ÛÛÛ ÛÛÛÜÜ²ÛÛÛ °°°  ²ÛÛÛ ±²' + #10 +
    '  Þ²²ÜÜÜÜÜÜÜÜÜ³ÜÜÜÜÜÜÜÜÜ ßßß  ßßßß      ßßßß ßßß ßßßß         ³           ±Û' + #10 +
    '  Þ²ß      ³  ³     ßÛÛ² ß ßÜÜ   CONTACT    ÜÜ ²ÛÛÛßßßßßßßßßßßßßßßßßßßßßßß²Û' + #10 +
    '  Þ°ß      ³  ³        ßßßßßßßßßßßßßßßßßßßßßßßßßßß            ³       Ýþþþ°Ý' + #10 +
    '  Þ°ß      ³  ³                                               ³       Ýþþþ°Ý' + #10 +
    '   Ûß  We are mainly lookin for Asian movies and musicvideos SuppliersÝþþþ²' + #10 +
    '   ²ß      ³  ³                                               ³       Ýþþþ²' + #10 +
    '   ²ÛÛÛÛÛ  ³  ³                                               ³   ²ÛÛÛÝþþþ±' + #10 +
    '   ²ß   Þ But most of all what we want/need is .Jp Tv Cappers!!  ±²Û  Ýþþþ±' + #10 +
    '   ±ß h!Þ  Þ  ³                                               ³ °±²ÛÞÜÝþþþ±' + #10 +
    '   ±ß   ÞÝ Þ  ³                                               ³°±±²Û  Ý   ²' + #10 +
    '   ²ßÞßÛÞÛÜÛÜÜÜÜÜÜÜÜÜÜÜÜ                            ÜÛÛßßßßßßßßßßßßÛßßßßßß²' + #10 +
    '   ²ÛÜÜÛÞÛ°±Ý°³ÛÜ      ßßßßßßßÜ  DONT HESiTATE !   Ü²ÛÝÜÜÜÜÜÜÜ³ÜÜÜÜÛÜÜÜÜÜÜ²' + #10 +
    '   ²°°²±Þ°°²Ý°³°ÛÜÜ EMAiL US;  ßþÜÜ         ÜÜÜÜÜÛÛÛÛÛÝ       ³  Þ±Û±±ÛÛ²°±' + #10 +
    '   ±°°²±Þ°°²Ý°³°±±²ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÞÛÜÜÜÜÜÜÜ³ÜÜÛÛÛÛ±ÛÛ²°±' + #10 +
    '   ±ÜÜÜÜÞÜÜ²Ý°³°±±±²²²²²ÛßßßßßßßßßßßßßßßßßßßßßßßßßßÛÛ         ³  Þ±Û±±ÛÛ²°±' + #10 +
    '   ±ÜÜÜÜÞÜÜÜ+°³°±±±²²²²²Û DARKSTARS@PROTONMAiL.COM ÛÛ ASCii: h!DSÞ±±±±ÛÛ²°±' + #10 +
    '   +±±²²²±ÛÛÛ+³°±±±²²²²²ÛÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÛÛÜÜÜÜÜÜÜÜÜ³ÜÜÛÛÛÛÛÛÛÛ²+' + #10 +
    '    ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++';

  fFileCount := TPazoMVIDTask.GetFileCountFromSFV(fSFV);
  fGenres := TPazoMVIDTask.TryToParseGenre(fNFO);
  fVideoRegion := TPazoMVIDTask.ParseVideoRegion(fNFO);

  fClass := TMVIDRelease.Create('Momoiro_Clover_Z-Hakkin_no_Yoake-JA-BLURAY-RETAIL-x264-2016-DARKFLiX', 'MVID');
  try
    fClass.SetValuesFromTask(fFileCount, (fVideoRegion = 'PAL'), (fVideoRegion = 'NTSC'), fGenres);

    CheckEquals(1, fClass.mvidfiles, 'Filecount mismatch');
    CheckEqualsString('', fClass.mvidgenre.CommaText, 'genre mismatch');
    CheckFalse(fClass.mvidpal, 'PAL mismatch');
    CheckTrue(fClass.mvidntsc, 'NTSC mismatch');
    CheckFalse(fClass.mvidva, 'Various Artists mismatch');
    CheckFalse(fClass.mvidlive, 'LIVE mismatch');
    CheckEquals(2016, fClass.mvidyear, 'Year mismatch');
    CheckEqualsString('JA', fClass.mvidlanguage, 'Language mismatch');
  finally
    fClass.Free;
  end;
end;

procedure TTestTMVIDRelease.TestTMVIDRelease5;
var
  fClass: TMVIDRelease;
  fSFV: String;
  fNFO: String;
  fFileCount: Integer;
  fGenres: TArray<String>;
  fVideoRegion: String;
begin
  fSFV := 'carousel_kings-bad_habit-ddc-720p-x264-2016-lovers_int.mkv 7b74c503';

  fNFO := ' °±±±²        ±²²±±° °°±²²± °±±±°   ±²°±°±±±±±°±°±°±²²°±±±±±°±°±²±±²°°   °°±±°    ' + #13#10 +
    '°±±  ²±     °²²°        °±²²±  °²  ±²°  °           °            ±±         °±°   ' + #13#10 +
    '°²   ²±      ²°    ±±°     ±±   ²±°²±  °°  °°±±±±±±±±   °±±²²²°      °±²±±°°°±    ' + #13#10 +
    '°²±  ±²°    ±°  ±²²±±±²±±   ±±  °²²²°  ±±   ±²²±± ±²²   ±±²±²²±   ±   °°±°±±²°    ' + #13#10 +
    ' ²°  ²±°   °²°  ±²°  °°±²°  ±²°  ±²±  °²±       °  ²±        °   ²²±         ±±°  ' + #13#10 +
    '°±°  ±²   °±±   ±±     °²±  ±²²   ±  °²°±   ° °°±° ±±       °   ²²²²²±²±²±±   ²±  ' + #13#10 +
    '°²   ±²±²²±²²±  °²±²°°±²±  °±°±±     ±±²±  °²²²²±±±²±   ±²±²²   ±²   ²±²²²±°  ±±  ' + #13#10 +
    '±²    ±°±°° ±±±   °±²±±   °²²  ±±   °±²²±   °°±°±±±°°   ²± °²°   ±°    °± °   ²   ' + #13#10 +
    ' ²°          ±²²       °°±²±   ²±° ±²° ±²              °²±  °°±± ±²±°       ±²°   ' + #13#10 +
    ' ±²±±°±±±±²±±°°±²±±±±±²²±°°     °°±±°   ²±±±±±±±±±±±²²²²±°°   °±±°°°²±±±²±²±±±°   ' + #13#10 +
    '   ±±±²±°±°°°°   °°±±°             °     °°²±±°±±°°±  °±         °     °°°°°      ' + #13#10 +
    '    ° °                    "' + #13#10 +
    'ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ' + #13#10 +
    'Ûß         ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿         ßÛ' + #13#10 +
    'Û          ³                The LOVERS TEAM Present:                ³          Û' + #13#10 +
    'Û ÚÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄ¿ Û' + #13#10 +
    'Û ³                                                                          ³ Û' + #13#10 +
    'Û ³          Carousel_Kings-Bad_Habit-DDC-720p-x264-2016-LOVERS_iNT          ³ Û' + #13#10 +
    'Û ³                                                                          ³ Û' + #13#10 +
    'Û ÀÄÄÄÄÄÂÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÂÄÄÄÄÄÙ Û' + #13#10 +
    'Û       ³                                                              ³       Û' + #13#10 +
    'Û       ³    Artist..........: Carousel Kings                          ³       Û' + #13#10 +
    'Û       ³    Title...........: Bad Habit                               ³       Û' + #13#10 +
    'Û       ³    Genre...........: Rock                                    ³       Û' + #13#10 +
    'Û       ³    Year............: 2016                                    ³       Û' + #13#10 +
    'Û       ³    Playtime........: 03:16                                   ³       Û' + #13#10 +
    'Û       ³                                                              ³       Û' + #13#10 +
    'Û       ³    Format..........: X264                                    ³       Û' + #13#10 +
    'Û       ³    Video resolution: 1280x536                                ³       Û' + #13#10 +
    'Û       ³    Video AR........: 2.40/1                                  ³       Û' + #13#10 +
    'Û       ³    Video Source....: DDC                                     ³       Û' + #13#10 +
    'Û       ³    Deinterlace.....: None (Progressive)                      ³       Û' + #13#10 +
    'Û       ³    Fps.............: 23.976                                  ³       Û' + #13#10 +
    'Û       ³    Video bitrate...: CRF 17 (3108 Kbps)                      ³       Û' + #13#10 +
    'Û       ³                                                              ³       Û' + #13#10 +
    'Û       ³    Audio format....: MP3                                     ³       Û' + #13#10 +
    'Û       ³    Audio frequency.: 44.1Khz                                 ³       Û' + #13#10 +
    'Û       ³    Audio Source....: Carousel_Kings-Charm_City-WEB-2017-ANGER³       Û' + #13#10 +
    'Û       ³                                                              ³       Û' + #13#10 +
    'Û       ³    Info Release....: 1 File - 80.2 Mo                        ³       Û' + #13#10 +
    'Û       ³    Rls date........: 12/05/17                                ³       Û' + #13#10 +
    'Û       ³                                                              ³       Û' + #13#10 +
    'Û       ³               ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿               ³       Û' + #13#10 +
    'Û       ³               ³ Support Artists Buy Releases ³               ³       Û' + #13#10 +
    'Û       ÀÄÄÂÄÄÄÄÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄÄÄÄÄÂÄÄÙ       Û' + #13#10 +
    'Û          ³         https://www.facebook.com/carouselkings/        ³          Û' + #13#10 +
    'ÛÜ         ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ         ÜÛ' + #13#10 +
    'ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß';

  fFileCount := TPazoMVIDTask.GetFileCountFromSFV(fSFV);
  fGenres := TPazoMVIDTask.TryToParseGenre(fNFO);
  fVideoRegion := TPazoMVIDTask.ParseVideoRegion(fNFO);

  fClass := TMVIDRelease.Create('Carousel_Kings-Bad_Habit-DDC-720p-x264-2016-LOVERS_iNT', 'MVID');
  try
    fClass.SetValuesFromTask(fFileCount, (fVideoRegion = 'PAL'), (fVideoRegion = 'NTSC'), fGenres);

    CheckEquals(1, fClass.mvidfiles, 'Filecount mismatch');
    CheckEqualsString('Rock', fClass.mvidgenre.CommaText, 'genre mismatch');
    CheckFalse(fClass.mvidpal, 'PAL mismatch');
    CheckFalse(fClass.mvidntsc, 'NTSC mismatch');
    CheckFalse(fClass.mvidva, 'Various Artists mismatch');
    CheckFalse(fClass.mvidlive, 'LIVE mismatch');
    CheckEquals(2016, fClass.mvidyear, 'Year mismatch');
    CheckEqualsString('EN', fClass.mvidlanguage, 'Language mismatch');
  finally
    fClass.Free;
  end;
end;

procedure TTestTMVIDRelease.TestTMVIDRelease6;
var
  fClass: TMVIDRelease;
  fSFV: String;
  fNFO: String;
  fFileCount: Integer;
  fGenres: TArray<String>;
  fVideoRegion: String;
begin
  fSFV := 'juliette_armanet-live_w9_garden_concert_(2017-09-09)-fr-x264-2017-iuf.mkv f85497b4';

  fNFO := '                      ±±±±                      ±±±±±±±±' + #10 +
    '                      ±±±±                      ±±±±±±±±' + #10 +
    '                      ±±±±                      ±±±±' + #10 +
    '                      ±±±±      ±±±± ±±±±       ±±±±' + #10 +
    '                      ±±±±      ±±±± ±±±±       ±±±±±±±' + #10 +
    '                      ±±±±      ±±±± ±±±±       ±±±±±±±' + #10 +
    '                      ±±±±      ±±±± ±±±±       ±±±±' + #10 +
    '                      ±±±± ±±±± ±±±± ±±±± ±±±±  ±±±±' + #10 +
    '                      ±±±± ±±°± ±±±±±±±±± ±±°±  ±±±±' + #10 +
    '                      ±±±± ±±±±  ±±±±±±±± ±±±±  ±±±±' + #10 +
    ' ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ' + #10 +
    'þÛ²²²²²²²²²²²²²²²²²²²²²²²² In U''r Face Presents : ²²²²²²²²²²²²²²²²²²²²²²²²²²²²Ûþ' + #10 +
    ' ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ' + #10 +
    '  ÛÛÛ²²Û²²ÛÛÛ±°                                                  °±ÛÛÛ²²Û²²ÛÛÛ' + #10 +
    '   ÛÛ²²Û²²ÛÛ±°                                                    °±ÛÛ²²Û²²ÛÛ' + #10 +
    '    Û²²Û²²Û±°    þ Artist ....þ Juliette Armanet                   °±Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û°                                                        °Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û                                                          Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ Title  ....þ Live W9 Garden Concert (2017-09-09)  Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û                                                          Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û                                                          Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û                                                          Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ Genre  ....þ Chanson                              Û²²Û²²Û' + #10 +
    '   ÛÛ²²Û²²ÛÛ     þ Video Year.þ 2017                                ÛÛ²²Û²²ÛÛ' + #10 +
    '  ÛÛÛ²²Û²²ÛÛÛ    þ Rel.Date...þ 18/09/2017                         ÛÛÛ²²Û²²ÛÛÛ' + #10 +
    ' ÛÛÛÛÛÛÛÛÛÛÛÛÛ                                                    ÛÛÛÛÛÛÛÛÛÛÛÛÛ' + #10 +
    'ÛÛ²²²²²²²²²²²ÛÛÜ                                                ÜÛÛ²²²²²²²²²²²ÛÛ' + #10 +
    'ÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÜ' + #10 +
    'ÛÛ²²²²²²²²²²²²²²²²²²²²²²²²²²²²² Encoding Info ²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²ÛÛ' + #10 +
    'ßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛß' + #10 +
    'ÛÛ²²²²²²²²²²²ÛÛß                                                ßÛÛ²²²²²²²²²²²ÛÛ' + #10 +
    ' ÛÛÛÛÛÛÛÛÛÛÛÛÛ                                                    ÛÛÛÛÛÛÛÛÛÛÛÛÛ' + #10 +
    '  ÛÛÛ²²Û²²ÛÛÛ                                                      ÛÛÛ²²Û²²ÛÛÛ' + #10 +
    '   ÛÛ²²Û²²ÛÛ                                                        ÛÛ²²Û²²ÛÛ' + #10 +
    '    Û²²Û²²Û      þ Source Video.þ DVB PAL                            Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ Convert......þ NO                                 Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ Format.......þ x264                               Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ Resolution...þ 720 x 400                          Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ Aspect Ratio.þ 16:9                               Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ Bitrate......þ 2742 kbps                          Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ Deinterlace..þ Yadif                              Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ Chapters.....þ NO                                 Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ Subtitles....þ NO                                 Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      --------------------------                          Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ Source Audio.þ DVB                                Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ Format.......þ MP2                                Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ Bitrate......þ 256 kbps CBR                       Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ SFX..........þ NO                                 Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ MP3 Release..þ                                    Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û                                                          Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û                                                          Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      --------------------------                          Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ Length.......þ 00:16:25                           Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ Size.........þ 369249779 octets                   Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û      þ CRC..........þ F85497B4                           Û²²Û²²Û' + #10 +
    '   ÛÛ²²Û²²ÛÛ                                                        ÛÛ²²Û²²ÛÛ' + #10 +
    '  ÛÛÛ²²Û²²ÛÛÛ                                                      ÛÛÛ²²Û²²ÛÛÛ' + #10 +
    ' ÛÛÛÛÛÛÛÛÛÛÛÛÛ                                                    ÛÛÛÛÛÛÛÛÛÛÛÛÛ' + #10 +
    'ÛÛ²²²²²²²²²²²ÛÛÜ                                                ÜÛÛ²²²²²²²²²²²ÛÛ' + #10 +
    'ÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÜ' + #10 +
    'ÛÛ²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²² Commentz ²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²ÛÛ' + #10 +
    'ßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛß' + #10 +
    'ÛÛ²²²²²²²²²²²ÛÛß                                                ßÛÛ²²²²²²²²²²²ÛÛ' + #10 +
    ' ÛÛÛÛÛÛÛÛÛÛÛÛÛ                                                    ÛÛÛÛÛÛÛÛÛÛÛÛÛ' + #10 +
    '  ÛÛÛ²²Û²²ÛÛÛ                                                      ÛÛÛ²²Û²²ÛÛÛ' + #10 +
    '   ÛÛ²²Û²²ÛÛ                                                        ÛÛ²²Û²²ÛÛ' + #10 +
    '    Û²²Û²²Û                         Enjoy ... :)                     Û²²Û²²Û' + #10 +
    '    Û²²Û²²Û                                                          Û²²Û²²Û' + #10 +
    '   ÛÛ²²Û²²ÛÛ                                                        ÛÛ²²Û²²ÛÛ' + #10 +
    '  ÛÛÛ²²Û²²ÛÛÛ                                                      ÛÛÛ²²Û²²ÛÛÛ' + #10 +
    ' ÛÛÛÛÛÛÛÛÛÛÛÛÛ                                                    ÛÛÛÛÛÛÛÛÛÛÛÛÛ' + #10 +
    'ÛÛ²²²²²²²²²²²ÛÛÜ                                                ÜÛÛ²²²²²²²²²²²ÛÛ' + #10 +
    'ÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÜ' + #10 +
    'ÛÛ²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²² Greetz ²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²²ÛÛ' + #10 +
    'ßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛß' + #10 +
    'ÛÛ²²²²²²²²²²²ÛÛß                                                ßÛÛ²²²²²²²²²²²ÛÛ' + #10 +
    ' ÛÛÛÛÛÛÛÛÛÛÛÛÛ                                                    ÛÛÛÛÛÛÛÛÛÛÛÛÛ' + #10 +
    '  ÛÛÛ²²Û²²ÛÛÛ                                                      ÛÛÛ²²Û²²ÛÛÛ' + #10 +
    '   ÛÛ²²Û²²ÛÛ                                                        ÛÛ²²Û²²ÛÛ' + #10 +
    '    Û²²Û²²Û          Mvreleaser coder , Suppliers And You.           Û²²Û²²Û' + #10 +
    '   ÛÛ²²Û²²ÛÛ                                                        ÛÛ²²Û²²ÛÛ' + #10 +
    '  ÛÛÛ²²Û²²ÛÛÛ                                                      ÛÛÛ²²Û²²ÛÛÛ' + #10 +
    ' ÛÛÛÛÛÛÛÛÛÛÛÛÛ                                                    ÛÛÛÛÛÛÛÛÛÛÛÛÛ' + #10 +
    'ÛÛ²²²²²²²²²²²ÛÛ                                                  ÛÛ²²²²²²²²²²²ÛÛ' + #10 +
    'ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ';

  fFileCount := TPazoMVIDTask.GetFileCountFromSFV(fSFV);
  fGenres := TPazoMVIDTask.TryToParseGenre(fNFO);
  fVideoRegion := TPazoMVIDTask.ParseVideoRegion(fNFO);

  fClass := TMVIDRelease.Create('Juliette_Armanet-Live_W9_Garden_Concert_(2017-09-09)-FR-x264-2017-iUF', 'MVID');
  try
    fClass.SetValuesFromTask(fFileCount, (fVideoRegion = 'PAL'), (fVideoRegion = 'NTSC'), fGenres);

    CheckEquals(1, fClass.mvidfiles, 'Filecount mismatch');
    CheckEqualsString('Chanson', fClass.mvidgenre.CommaText, 'genre mismatch');
    CheckTrue(fClass.mvidpal, 'PAL mismatch');
    CheckFalse(fClass.mvidntsc, 'NTSC mismatch');
    CheckFalse(fClass.mvidva, 'Various Artists mismatch');
    CheckTrue(fClass.mvidlive, 'LIVE mismatch');
    CheckEquals(2017, fClass.mvidyear, 'Year mismatch');
    CheckEqualsString('FR', fClass.mvidlanguage, 'Language mismatch');
  finally
    fClass.Free;
  end;
end;

procedure TTestTMVIDRelease.TestTMVIDRelease7;
var
  fClass: TMVIDRelease;
  fSFV: String;
  fNFO: String;
  fFileCount: Integer;
  fGenres: TArray<String>;
  fVideoRegion: String;
begin
  fSFV := 'skrillex_and_poo_bear-would_you_ever-dvdrip-x264-2017-srpx.mkv 805c1150';

  fNFO := 'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ            ß    ÜÜ                            ÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ      Ü   Ü     Û°²Û                           ÿÿ' + #10 +
    'ÿÿÿÿÿÿÿ  ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ          Û Û     ßß  Ü                         ÿÿ' + #10 +
    'ÿÿÿÿÿÿ Þßÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ    ÜÜÜ    ß                  ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿ ßÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ  Û °±Û  Ü       Û     Ü     ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ  ÿÿÿÿÿÿ  Û°±²Û      Ü     Ü  Û²Û    ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ Þßÿÿÿÿÿÿ   ßßß      Û²Û        ß     ÿÿÿÿÿÿÿÿÿÿÜÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿ  ÿÿÿ ßÿÿÿÿÿÿÿ    ß   Ü    ß  Ü   Ü        ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿ Þßÿÿÿÿÿÿÿÿÿÿÿÿ           ß      ß          ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿ ßÿÿÿÿÿÿÿÿÿÿÿÿÿ ÿÜÛÛßßßßÛÛÛÛßÛÛÛÛÛÛßßßÛÛÜÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ ÿÛ²°    ²ÛÛÛ ²²ÛÛ²±  ±°°Ûÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛßÿÿ ÿ ßÛßßßßÛÛÛÛßÛÛÛÛÛÛÛßÛÛß  ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ°ÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÜÛßÿ  ÿÿÿÛ ÿÿ ²ÛÛÛÜÛÛÛÛÛÜÜÛÛÛÛ  ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ±ÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛÛÛÿÿ  ÿÿ ÛÜÜßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  ÿÿÿÿÿÿÿÿÿÿÿÿ°ÿÿÿÿÿÿ²ÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÜÛÿÿÿÿÿÿÿÿßÿÿ   ÿÜÛßÜÜÛÛÛÛÛÛÛÛÛÛÛÛ°° Û  ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿßÜÛÿÿÿÿÿÿÿÿÿÿÿ   ÿÞÛÛÛÛÛßßÛÛÛÛ°ÛÛÛ²°  ÛÿÿÿÿÿÿÿÜÿÿÿÿÿÿÿ²ÿÿÿÿÿÿÛÝÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿß Ûÿÿÿÿÿÿÿÿÿÿÿ   ÿÿßÛÛ²° ±ÛÛÛ°±ÛÛÛ±°  ÛÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÞÝÿÿÿÿÞÛÝÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÜÜÛÿÿÿÿÿÿÿÿÿÿÿ ÿ ÿÿ Û °± ±ÛÛÛ±²ÛßÛÜÜÜßÛÛÜ  ÿÿÿÿÿÿ ÿÿÿÜÿßÜÿÿÞÛÛÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÛÛÛÛÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿÿÿÛ ÿ°°²ßßÜ²ÛÛÛÛÛÜÜÛÛÛÛ  ÿÿÿÿÿÿÿÿÿÿÿÿÿÜÜÛÛß ÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿßßÿÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿÿ ÛÜÜßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  ÿÿÿÿÿÿÿÿÿÿÿÿÜÛÛßßÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿÜÛßÜÜÛÛÛÛÛÛÛÛÛÛÛÛ°° Û  ÿÿÿÿÿÿÿÿÿÿÿÿÞÛÛÝÿ²ÿÿÿÿÿÿß' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛßÜ  ÿ ÿ ÿÞÛÛÛÛÛßßÛÛÛÛ°ÛÛÛ²°  ÛÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛ²ÛÿÜßÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛÜÿßÿÿ ÿ ÿÿßÛÛÿ° ±ÛÛÛ²±ÛÛÛ±°  ÛÿÿÿÿÿÿÿÿÿÿÜÿÿÿÞÛÛÝÿÿÿÿÜÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛÿßÿÿÿ ÿÿÿÿ Û  °±±ÛÛÛ±²ßßÜÜÜÜßÛÛÜ  ÿÿÿÿÿÿÿÿÿÿÿßÛÛÜÜÿÿÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÜÜÜÛÿÿÿÿÿ ÿÿÿÿÿÛ  ±²²ßßÜÜÛÛÛÛÛÜÜÛÛÛÛ  ÿÿÿÿÿÿÿÿÿÿÜÿÿßßÛÛÛÛÛÜÜÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÛÛÛÛÛÿÿÿÿÿ ÿÿÿÿ ÛÜÜßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  ÿÿÿÿÿÿÿÿÿÿÛÿÿÿÿÿÿÿÿÿÿßÛ²' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿßßßÿÿ     ÿÿÿÜÛßÜÜÛÛÛÛÛÛÛÛÛÛÛÛ°° Û  ÿÿÿÿÿÿÿÿÿÿ²ÝÿÿÿÿÿÿÿÿÿÿÿÞÛ²' + #10 +
    'ÿÿÿÿÿÿÜÛÿÿÿÿÿÿÿÿÿÿÿ     ÿ ÿÞÛÛÛÛÛßßÛÛÛ²ÛÛÛÛ²°  ÛÿÿÿÿÿÿÿÜÜßÿÿ²ÝÿÿÿÜÿÿÿßÿÿÿÿÛÛÝ' + #10 +
    'ÿÿÿÿÿßÜÛÿÿÿÿÿÿÿÿÿÿÿ     ÿ ÿÿßÛÛ°  ±ÛÛÛ±²ÛÛÛ±°  ÛÿÿÿÿÿÿÿÿÛß ÿÿ²ÿÿÿÿÿÿÿÿÿÿÿÞÛ²' + #10 +
    'ÿÿÿÿÿß Ûÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿ° Û²   ±ÛÛÛ°±ÛÛÛÜÜÜßÛÛÜ  ÿÿÿÿ Ûÿÿÿÿ²ÜÿÿÿÿÿÿÿÿÜÛ²ß' + #10 +
    'ÿÿÿÿÿÜÜÛÿÿayl!croÿÿÛßÜ  ÿÿÿ±ÿÛ±ÿÿ ²ÛÛÛÜÛÛÛÛÛÜÜÛÛÛÛ  ÿÿÿÜÛÛÝÿÿÿÿßßÿÜÜÜÜÛÛÛÛß' + #10 +
    'ÿÿÿÿÛÛÛÛÿÿÿÿÿ  ÿÿÿÿÛÜÿß ÿÿÿÿ ÛÜÜßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  ÿÿÿÿÿßßÿÿÿÜÜÛÛÛÛ²²ÛÛÛßÿÿ Ü' + #10 +
    'ÿÿÿÿÿßßÿÿÿÿÿÿ  ÿÿÿÿÛÿßÿ ÿÿÿÜÛßÜÜÛÛÛÛÛÛÛÛÛÛÛÛ°  Û ±ÿÜÿÿÿÿÜÿÿÜÛÛ²ÛÛÛßßßßÿÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿ  ÿÜÜÜÛÿÿÿ ÿÿÿÞÛÛÛÛÛßßÛÛÛÛ²ÛÛÛ²°  Ûÿ²ÿÿÿÿÿÿÿÿÛÛ²±Ûß ÿÿ²ÜÿÿÿÜÛÜ' + #10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿ  ÛÛÛÛÛÿÿÿ ÿÿÿÿßÛÛ°  ±ÛÛÛ²²ÛÛÛ±° °ÛÿßÿÿÿÿÿÿÿÞÛ²±ÛÝÿÿÿÿÿ²ÛÜÿÿßÿ   Ü' + #10 +
    '°ÿÿÿÿÿÿÿÿÿÿÿÿ  ÿßßßÿÿ  ÿÿÿÿ± Û² ° ±ÛÛÛ²²ßßÜÜÜÜßÛÛÜ  ÿÿÜÿÿÛ²°°ÛÿÿÿÿÿÜÿ²ÛÜÿÿÿ' + #10 +
    'ÿÿÿÿÿÿÿÿÛßßÿÿ          ÿÿÿÿ²ÿÛ±ÿÿ ²ßßÜ²ÛÛÛÛÛÜÜÛÛÛÛ  ÿÿÿÿÿÞÛ°²ÛÿÿÜÿÿÿÿÞÛ²ÿÿÜ' + #10 +
    ' ÿÿÿÿÿÿÿÛßÿÿÿÿÿÿ       ÿÿÿÿß ÛÜÜßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  °ÿÿÿÿÿÿÛÛ²ÛÝÿÿÿÜÿÿÞÛ²ÿÿÿ' + #10 +
    '°ÿÿÿÿÿÜÜÛÿÿÿÿÿÿÿÿÿÿ ÿÿÿÿÿ°ÿÜÛßÜÜÛÛÛÛÛÛÛÛÛÛÛß °²Û °ÿÿÿÜÿÿÜÿÿßÛ²ÛÿÿßÛß ÞÛ²ÿÿÿ  Ü' + #10 +
    '°ÿÿÿÿÛÛÛÛÿÿÿÿÿÿÿÿÿÿ ÿÿ°ÿÿÿÿÞÛÛÛÛÛßßÛÛÛÛ°ÛÛÛ° °²Ûÿ± °ÿÿ°ÿÿÿÜ  ßßÛÜ ÿÿ Û²ÿÿÿÿ' + #10 +
    'ÿÿÿÿÿÿßßÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿÿÿÿ°ÿßÛÛÿ  ±ÛÛÛ°±ÛÛÛ± °²Ûÿ²°°ÿ° °ÿ ÜÜÜÜ  Û  ÜÛßÿÿßÿÿ°  °' + #10 +
    '°ÿ°ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿÿÿÿÿ²ÿ²Û   ²ÛÛÛ°²ÛÛÛ² °²ÛÿÛ±ÿ°±  ÜÛÛ²±²ÛÜ  ß   ÿÿÿÿ' + #10 +
    '°ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ°ÿÿ ÿÿÿ°ÿÿ°²ÿ²Û ÿ ÛÛÛÛ±²ÛÛÛ² °²ÛÿÛ²°±² ÛÛ²°  °±²ÛÜ ß Ü  °ÿÿÜ  °' + #10 +
    '°°ÿÿÿÿÿ°            ÿ°ÿÿÿ°²²ÿ²Ûÿÿ Û²ÛÛ±²ÛÛÛÛ °²ÛÿÛ²±²ÛÞÛ²±     °°²ÛÜ    Ü ÿ   °' + #10 +
    '°ÿÿÿ°ÿÿÿ          ° ÿÿÿ°ÿ°²Ûÿ²Û ÿ Û²ÛÛ²²ÛÛÛÛ °²ÛÿÛÛ²ÛÛÞÛ²±°   °°±±²²ÛÜ     °  °' + #10 +
    '°ÿ°ÿ ÿÿÿ  °  °      °ÿÿ°°²²Ûÿ²Ûÿÿ Û²ÛÛ²²ÛÛÛÛ °±ÛÿÛÛÛÛÛ ÛÛ²±°°°°°°±±²²²ÛÜ  ° °' + #10 +
    '°°ÿÿÿÿÿ°       ° °  ÿ°°°±²ÛÛÿÛÛÿÿ ÛÛÛÛÛ²ÛÛÛÛ  °Û ÛßÿÜÿÜÛÜßÛ²°±°±±±²²Û²ÛÛ ± °  °' + #10 +
    '±°ÿÿ°ÿÿÿ   °  ° ° °±°±±±²ÛÛ ÞÛÛÿ ÿÛÛÛÛÛ²ÛÛÛÛ   ßÝ ÜÛßÛÛ±°ÛÜßÛ²±²±²Û²ÛÛÛÛ ²± ° ±' + #10 +
    '°±°°ÿ° ÿ°      °°°°±±²²ÛÛßÿÜÛÛÛÜ  Û²ÛÛÛÛÛÛÛÛÝ  ÜÛÜÛ²Ü°ßÛÛ±°ÛÜßÛ²Û²ÛÛÛÛÛ Ü²² ± ±' + #10 +
    '±°°°°°°ÿ ° ° °±°²±±²²ÛÛßÿÜÛÛÛÛÛÛÛÛÛ²ÛÛÛÛÛÛÛÛÛÜÛÛÛÛÛßÜßÜ°ßÛÛ±°ÛÜÛÛÛÛÛÛß ÜÛÛ²± °°' + #10 +
    '±°°±°±°°°°°°°°²±±²²ÛÛßÿÜÛÛÛÛÛÛÛÛÛ²²²ÛÛÛÛÛÛÛÛÛÛÛÛ²²ÛÛÛßÜßÜ°ßÛÛß  ßßß ÜÜÛÛÛ²±°±°±' + #10 +
    '±±°°°°°°°°°±°±±²²ÛÛß ÜÛÛÛÛÛÛÛ²²²²²²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²²ÛÛÛßÜßÜ²ßÛ ÛÛÛÛÛÛÛÛÛ²±±°°°°' + #10 +
    '±±±°°°°°°°±°±²²ÛÛßÿÜÛÛÛÛÛÛÛÛÛ²²²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ÛÛÛÛßÜÜß ÜÛ²ÛÛÛÛÛ²²±±°°°±°' + #10 +
    '²±°°±°°±°°°±²ÛÛßÿÜÛÛ²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ÛÛÛÜ ßÛÛÛÛÛÛ²ÛÛ²²±°°°°±' + #10 +
    '²±°±°°°°±²±²ÛÛ ÜÛÛÛÛ² ßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ß ±²²ÛÛÜÿÛÛ²ÛÛÛ²²±±°°±°°±' + #10 +
    '²±°°°°±°°±²ÛÛÿÜÛ²ÛÛ²      ßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ß    °±²ÛÛÜÿÛÛÛÛ²Û²±°°°°°±±' + #10 +
    '²±±°±°°±²±²Û ÜÛ²ÛÛ²  ÿÿÿ  ÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²±°  ÿ  °±²²ÛÜÿÛÛÛÛ²²²°°°°°±²' + #10 +
    'Û±°±°°°°±²Ûß Û²ÛÛ²  ÿÿÿÿÿÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²Û²Û²±°ÿÿÿÿ °±²²ÛÜÿÛ²ÛÛ²±°±°°±±²' + #10 +
    '²±²°°°±°±²Û ÛÛ²ÛÛ ÿÿÿÿÿÿÛß°²²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²Û²±°ÿÿÿÿ °±²²Û ßÛÛ²²±°°°°°±²' + #10 +
    'Û²±°±±°±²ÛÛ Û²ÛÛÝÿ  ÿÿ Ûß° °±²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²°°ÿÿÿÿ°²²ÛÛ ÛÛ²±°°°±°±±Û' + #10 +
    'Û²±±°°²±²ÛÝÞÛ²ÛÛÿÿÿÿÿ Û²  °°°²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßß²Û²±°    ±²²Û ÛÛ²²±°°°²±²²' + #10 +
    'ÛÛ²°±°°²²ÛÝÞÛÛÛÝÿÿÿÿ ÜÛ  ÿ° °±ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ    ²ÜÛÛ²±°ÿÿÿ°±²ÛÝÞÛ²±°±°°°±²Û' + #10 +
    'ÛÛ²±°²±²²ÛÿÛÛÛÛ    ÿ Û ° ° °±²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²²ÜÜÛß²ÛÛ²±° ÿ °²²ÝÞÛ²±±°°°±±²Û' + #10 +
    'Û²²²°°²²ÛÛÿÛÛÛÛÛÜ   ÛÛ     ±±ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßß ²ÜÛÛÛ²²±   °±²ÛÿÛ²²°±°°°²²Û' + #10 +
    'ÛÛ²±±°±²²ÛÿÞÛÛÛÛÛÛÛÜÛ   ° °±²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ²ÜÛÛÛÛÛÛ²±°±°±²ÛÛÿÛ²±±°°°°±²Û' + #10 +
    'ÛÛ²±²±²²ÛÛÝÞÛÛÛÛÛÛÛÛÛÛÛÜÜÜÜ²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²²²Û²²ÛÛÝÿÛ²²±°°±°±²Û' + #10 +
    'Û²Û²±±²Û²ÛÝÿÛ²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²Û²ÛÛÿÞÛÛ²²±°°°²²Û' + #10 +
    'ÛÛÛ²²²²²ÛÛÛÿßÛ²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ÛÛ²ÛÛßÿÛÛ²²±°°±°±²Û' + #10 +
    'ÛÛ²Û²²ÛÛÛ²ÛÛÿßÛ²²ÛÛÛß ÜÜÜ ßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßÿÛÛÛÛ²²±±°±±²Û' + #10 +
    'ÛÛÛÛÛ²Û²ÛÛÛÛÛ ßÛÛ²²Û Ûß ßÛ ÛÛÛÛÛÛÛßßßßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ÛÛ²ÛÛßÿÛÛÛ²ÛÛ²±²±±²ÛÛ' + #10 +
    'ÛÛÛÛ²ÛÛÛÛÛ²ÛÛÛÜÿßÛÛÝÞÛÝ Ûß ßß ÜÜÜÜÜÛÛÛÜÜÜÜ ßßßÛßßßÛÛÛÛÛ²ÛÛÛÛÛßÿÜÛÛ²ÛÛÛ²²²±±²²²Û' + #10 +
    'Û²ÛÛÛÛ²ÛÛÛÛÛÛÛÛß  ßß ÛÛÜÜÜÛÛÛÛÛÛ²²²ÛÛÛÛÛÛÛÛÛÛÜÜ ßÜÜ ßßßßÛßßÿÜÜÛÛÛÛÛÛ²ÛÛ²Û²²²²ÛÛ' + #10 +
    'ÛÛÛÛÛÛÛÛÛÛßß ÜÜÜÛÛÛÛÜÜÜÜ ßßÛ²²²ÛÛÛÛÛÛÛÛÛÛÛÛÛßßßÛÜ ßÛÛÛÛÜÜÜÜÜÜÜÜ ßßßßÛÛÛÛÛÛÛ²ÛÛÛ' + #10 +
    'ÛÛÛÛßÛÛÛßÿÜÛÛÛÛ²ÛÛÛÛÛÛ ßßÛÜ ßÛÛÛÛÛÛÛÛÛÛÛÛÛÛ     ÛÛ ßÛ²²ÛÛ²²²ÛÛÛÛÛÛÛÜÜ ßßÛÛ²ÛÛ²Û' + #10 +
    'ÛÜÛÛÛÛÛÿÜÛÛ²²²ÛÛÛÛÛÛÛÛÜÜ  ÛÛ ÛÛÛÛÛßßß  ßßÛÛÛÛÜ   ÛÛ ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßÛÜ ßÛÛÛÛÛ' + #10 +
    'ÛÛÛÛÛÛÿÜÛ²²²ÛÛÛÛÛÛÛÛÛÛÛÛÛ °ÛÝÞÛÛÛÝ °°°±²Ü ßÛÛÛÛ  °ÛÝÞÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  ßÛ ßÛÛßÛ' + #10 +
    'ÛÛÛßÛÝÿÛ²²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ±²Û ÛÛÛÛ ±²²±²²ÛÝÞÛÛÛÛ °ÛÝÞÛÛÛÛÛßßßßÛÛÛÛÛÛÜ   ßÛÿÛÛÛÛ' + #10 +
    'ÛßÛÛÛÝÞÛ²ÛÛÛÛÛÛÛß  ßÛÛÛÛÛÛ²ÛÛ ÛÛÛÛ ²²Û²ÛÛÛÛ ÛÛÛÛÛ±ÛÛ ÛÛÛÛÛÝ°±ÜÜ ßÛÛÛÛÛ°  ÛÝÞÛÛÛ' + #10 +
    'ÛÛÛÛÜÝÞ²²ÛÛÛÛÛÛÝÞÛÛÝÞÛÛÛÛÛÛÛÛÝÞÛÛÛÝÞÛ²Û²ÛÛÝÞÛÛÛÛÛ²ÛÛ ÛÛÛÛÛÝ ²²²ÛÝÞÛÛÛÛÛ  °ÝÞÜÛÛ' + #10 +
    'ÛÛßÛÛÝÞ²²ÛÛÛÛÛÛÿßÛß ÜÛÛÛÛßßß ÜÛÛÛÛÝ ÛÛÛßß ÜÛÛÛÛÛÛÛÛÝÞÛÛÛÛÛÛ ÛÛ²²ÛÿÛÛÛÛÛ± ±ÛÿÛÛÛ' + #10 +
    'Û   ÛÝÞÛ²ÛÛÛÛÛÛÛÜ  ßßß ÜÜÜÝÞÛÛÛÛÛÛÛ ß ÜÜÛÛÛÛÛÛÛÛÛÛÛÝÞÛÛÛÛÛÛ Û²ÛÛßÞÛÛÛÛÛ² ²ÛÿÛÛÛ' + #10 +
    'ÛÛÜÛÛÝÿÛÛ²ÛÛÛÛÛÛÛÛÛÜÜÜ ßßÛÛÿÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ÛÛÛÛÛÛÝÞÛßß ÜÛÛÛÛÛÛÛ ÛÝÞÛßÛ' + #10 +
    'ÛÛÛßÛÛÜ ÛÛÛÛÛÛÛÛÛÛÛÛÛÛßÛÜÜ ÿÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ÜÛÛÛÛÛÛÝÜÜÜÛÛÛÛÛÛÛÛÛÛÛÛÝÞÛÛÛ' + #10 +
    'ÛÛßßÛÛÛÜ ßßÛÛÛÛÛÛÛÛÛÛÛÛÜ²ßÛ ßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛß ÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÿÛÜÛÛ' + #10 +
    'Û    ÛßÛÛÛÜÜ ßßßÛÛÛÛÛÛÛÛÛÜßÛ ÛÛÛÛÛÛÛÛÛÛÛÛÛÛßßß ÜÜÿÛßßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÿÜÛÛßÛ' + #10 +
    'ÛÛÜÜÛÛÛÛÛßßß ÜÜÜ  ßÛÛÛÛÛÛÛ°ÛÝÞÛÛÛÛÛÛ ßÛÛÛÛÛÛÜ ßÛÝÞÛ ßÜ ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßÿÜÛÛßÛÛ' + #10 +
    'ÛÛÛßß ÜÜÜÜÛÛÛÛß ÜÛÜ ÛÛÛÛÛÛ±ÛÝÞÛÛÛÛÛÛ ÜÿÛÛÛÛÛÛÛÜÜ ßßß ÛÝÞÛ ßßÛÛÛÛÛßßßßÿÜÜÛÛÛ   Û' + #10 +
    'Ûß ÜÛÛÛÛÛÛÛÛÛÛÝßÛÛßÞÛÛÛÛÛÛ²ÛÝÞÛÛÛÛÛÛÝÞÜÿÛÛÛÛÛÛÛÛÛÛÜÜÛÛÝÞÛ ÛÜÜÜÜÜÜÜÛÛÛßÛÛÜÛÛÛÜÛÛ' + #10 +
    'Ý Ûß ßÛÛÛÛÛÛÛÛÛÜ  ÜÛÛÛÛÛÛÛÛÛÝÞÛÛÛÛÛÛÝÞÛÿßÛÛÛÛÛÛÛÛÛÛÛÛÛ ÛÝÞÛÛß ßÛÛÛÛÛ   ÛÛÛßßßÛÛ' + #10 +
    'ÝÛÝ ßÜÞÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ÛÛÛÛÛÛÞÝ ÛÛ ÛÛÛÛÛÛÛÛÛÛÛÛ ÜÛÝÞÛÛÛÜÛÛÛßÛÛÛÜÛÛÛ     Û' + #10 +
    'Ü ßÜÜß ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛß ÛÛÛÛÛÛ Û ÛÛÜ ÛÛÛÛÛÛÛÛÛÛ ÜÛÛÛ ÛÛÛÛßÛÛÛÛÛÛÛÛÜÛ     Û' + #10 +
    'ÛÛÜÜÜÜÝÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ÛÛÛÛÛÜÜÜÛÜ ÛÛÜÿßÛÛÛÛÛÛÛ ÜÛÛÛÛÝ ÛÛÛÛÛÛßÛÛßßßßÛÛÜÜÜÛÛ' + #10 +
    'ÛÜÛßÛÛÝÞÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ÜÛÛÛßßß ÜÜÜÜÛÛßÛÜÿßÛÛÛÛÝÞÛÛÛÛÛÛÜ ßÛÛÛÛÛÛ x  x ÛÛÛßÛÛ' + #10 +
    'ÛÛ   ÛÛÿßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛß ÿÛÛÛ ÜÜ ßÛßÛÛÛ   ÛÛÿÜÿßßÝÞÛÛÛÛÛÛÛÛÜÿßßÛÛ        Û   Û' + #10 +
    'ÛÛÛÜÛßÛÛÜÜ ßßßÛÛÛÛÛßßßÿÜÜÛ ÛÛÝ   Û ÛÛÛßÛÛÜÛÛÛ ÛÛÛÜÜÛÛÛßßßßßßÛÛÛÜÿÛ ßÜÜÜÜß ÛÛÜÛÛ' + #10 +
    'ÛÛÜÛÛÛÛßßÛÛÛÛÜÜÜÜÜÜÜÛÛÛÛÛÛÜ ÛÛÜÜÛÛ ÛÛÛÛÛÛÛÛÜÛ ÛÛßß   ÜÜÛÛÛß Ü ßÛÝÞÛÜ    ÜÛÛÛÛÛÛ' + #10 +
    'ÛÛÛÛÛßßÜÜßÿÜÿÿÿÿÿÿÿÿÿßÿÿ     ßßßß ÿÿÿßÿ   Ü  ÿÛÿÿÿßÜÜß ÿÜÿÿÛ  ÜÛÝ ÜÿßßßßÿßÛÛÛÛÛ' + #10 +
    'Û²²ÛÝÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ       ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿßÛÛÛßÿÿÿÿÿÿÿÿÿÿÞÛ²²Û' + #10 +
    'Û²°ÛÿÜÿÿÿArtist......: Skrillex And Poo Bear                   ÿÿÿÿÿÿÿÿÿÿÜÿÛ°²Û' + #10 +
    'Û±°² ÿÿÿÿTrack Title.: Would You Ever                            ÿÿÿÿÿÿÿÿÿ ²°±Û' + #10 +
    'Û°ÜßßÜÿÿÿGenre.......: House                                   ÿÿÿÿÿÿÿÿÿÿÜßßÜ°Û' + #10 +
    'Û°ßÜÜßÿÿÿYear........: 2017                                    ÿÿÿÿÿÿÿÿÿÿßÜÜß°Û' + #10 +
    'Û°°²ÿÿÿÿÿRip date....: 2017-09-17                              ÿÿÿÿÿÿÿÿÿÿÿÿ²°°Û' + #10 +
    'Û°°ÛÿÿÿÿÿLength......: 00:03:42                                ÿÿÿÿÿÿÿÿÿÿÿÿÛ°°Û' + #10 +
    'Û°°ÛÿÿÿÿÿSize........: 56 MB                                    ÿÿÿÿÿÿÿÿÿÿÿÛ°°Û' + #10 +
    'Û°°Û     Resolution..: 704x480 (AR: 1.737)                                 Û°°Û' + #10 +
    'Û°°Û     Format......: x264 NTSC 23.976 FPS / 1824 kbps                    Û°°Û' + #10 +
    'Û°°ÛÿÿÿÿÿAudio.......: 44100Hz VBR MP3 ~240kbps                ÿÿÿÿÿÿÿÿÿÿÿÿÛ°°Û' + #10 +
    'Û°°Û °   Deinterlace.: Manual IVTC                                       ° Û°°Û' + #10 +
    'ÛÜ°Û ±   Video Source: Promo.Only.Hot.Video.September.2017.NTSC.DVD9.-   ± Û°ÜÛ' + #10 +
    'Û°°Û ±                 MDVDR-AURORA                                      ± Û°°Û' + #10 +
    'Û°°Û ±   Audio Source: Skrillex_and_Poo_Bear-Would_You_Ever-WEB-2017--   ± Û°°Û' + #10 +
    'Û°±Û ²                 iTS                                               ² Û±°Û' + #10 +
    'Û±²Û ÛÜ                                                                 ÜÛ Û²±Û' + #10 +
    'Û²²Û ßßßßßß ß                                                      ß ßßßßß Û²±Û' + #10 +
    'Û²²Û °±²ÛÛÛÛÜ ÛÛßÜ ÛÛßß ÛÛ   ÛÛßß ÛÛßÛ ÛÛßÛ ÛÛßß ÛÛ ÛÜ Û ÛÛßß ÛÛßÛ ÜÛÛÛ²±° Û²²Û' + #10 +
    'Û²²Û     ÿÿßÛ ÛÛÜß ÛÛÜ  ÛÛ   ÛÛÜ  ÛÛÜÛ ²ÛÜÜ ÛÛÜ  ÜÜ ÛÛÛÛ ÛÛÜ  ÛÛ Û Ûßÿÿ    Û±²Û' + #10 +
    'Û²²Û    ÿÿÿÿ² ²Û Û ²ÛÜÜ ²ÛÜÜ ²ÛÜÜ ²Û Û ÜÜÜÛ ²ÛÜÜ ²Û ²Û Û ²Û   ²ÛÜÛ ²ÿÿÿÿ   Û²±Û' + #10 +
    'Û²°Ûÿ                                                                     ÿÛ°²Û' + #10 +
    'Û°±Û                                                                       Û²°Û' + #10 +
    'Û°±Û                                                                       Û²°Û' + #10 +
    'Û°±Û ±                                                                   ± Û²°Û' + #10 +
    'Û±°Û ²                                                                   ² Û°°Û' + #10 +
    'Û°±Û ÛÜ                                                                 ÜÛ Û°°Û' + #10 +
    'Û°°Û ßßßßßß ß                                                      ß ßßßßß Û±°Û' + #10 +
    'Û±²Û °±²ÛÛÛÛÛÛÛÜ ÛÛßß ÛÛßÜ ÛÛßÛ ÛÛ Û ÛÛßÜ ÛÜ Û ÛÛßß ÛÛ   Û ÛÛßÛ ÜÛÛÛÛÛÛ²±° Û²²Û' + #10 +
    'Û²±Û          ßÛ ÛÛ Û ÛÛÜß ÛÛ Û ÛÛ Û ÛÛÜÛ ÛÛßÛ ÛÛÜ  ÛÛ Ü Û ²ÛÜÜ Ûß         Û±²Û' + #10 +
    'Û²±Û           ² ²ÛÜÛ ²Û Û ²ÛÜÛ ²ÛÜÛ ²Û   ²Û Û ²ÛÜÜ ²ÛÛßÛÛ ÜÜÜÛ ²          Û±²Û' + #10 +
    'Û±²Û                                                                       Û²±Û' + #10 +
    'Û±²Û     For all other non-rock/metal genres and music videos we feel      Û±²Û' + #10 +
    'Û°²Û     that do not fit into the SRP group, SRPx!                         Û²±Û' + #10 +
    'Û±²Û                                                                       Û±°Û' + #10 +
    'Û²±Û                      Anything To Offer? Contact:                      Û±²Û' + #10 +
    'Û²ÛÛ                                                                       ÛÛ²Û' + #10 +
    'ÛÛ²Û ß                                                                   Ü Û²ÛÛ' + #10 +
    'Û²ÛÛ                            srp @ mail . az                            ÛÛ²Û' + #10 +
    'ÞÛ²ÛÝ  Ü      ÜÜÜ                                             Ü        Ü  ÞÛ²ÛÝ' + #10 +
    ' ÛÛ²ÛÝ    Ü Üß°° ßÜ Ü                       ÜÜÜ    Ü        Ü  Ü²Ü       ÞÛ²ÛÛ' + #10 +
    '  Û²Û²ÛÜÜ   Û±°   Û   ÜÜ AyLieN/cRO Ü      Û²± Û       ÜÜ v0.6  ß   ß ÜÜÛ²Û²Û' + #10 +
    '   ßÛ²ÛÛ²ÛÛÛÛÛÜÜÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ±  ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßßßÛÛÛÛÛ²ÛÛ²Ûß' + #10 +
    '     ßßÛÛÛß²ßÛÛÛÛÛÛÛÛÛÛÛÛÛßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²°   ÛÛÛÛÛÛßß' + #10 +
    '          ßÜß      ßß    Û²±Û    Ü   ß   Ü  ß    Ü      Ü   Û±°   Û   ÜÜ  Ü' + #10 +
    '        ß        Ü   ÜÜ   ßß    Û²Û             Û²Û  Ü       ßÜÜÜß Ü Û±²Û' + #10 +
    '              Ü     Û±²Û     Ü   ß     ²Û   Ü    ß       Ü  Ü         ßß' + #10 +
    '     Ü       Û²Û     ßß                                 Û²Û     Ü ²Û' + #10 +
    '              ß          Ü          ß      Ü    Ü   ß    ß             Ü' + #10 +
    '         Ü       Û² Ü   Û²Û     Ü      Ü                       ß' + #10 +
    '             Ü           ß                                  Ü      Ü' + #10 +
    '                     ß             Û²         ß       ²Û        Ü' + #10 +
    '      ß          Ü         Ü              Ü' + #10 +
    '                    Ü                             ß                     Ü' + #10 +
    '                                    ß' + #10 +
    '            Ü                                  Ü         Ü     ß' + #10 +
    '                     ß                  Ü ';


  fFileCount := TPazoMVIDTask.GetFileCountFromSFV(fSFV);
  fGenres := TPazoMVIDTask.TryToParseGenre(fNFO);
  fVideoRegion := TPazoMVIDTask.ParseVideoRegion(fNFO);

  fClass := TMVIDRelease.Create('Skrillex_And_Poo_Bear-Would_You_Ever-DVDRip-x264-2017-SRPx', 'MVID');
  try
    fClass.SetValuesFromTask(fFileCount, (fVideoRegion = 'PAL'), (fVideoRegion = 'NTSC'), fGenres);

    CheckEquals(1, fClass.mvidfiles, 'Filecount mismatch');
    CheckEqualsString('House', fClass.mvidgenre.CommaText, 'genre mismatch');
    CheckFalse(fClass.mvidpal, 'PAL mismatch');
    CheckTrue(fClass.mvidntsc, 'NTSC mismatch');
    CheckFalse(fClass.mvidva, 'Various Artists mismatch');
    CheckFalse(fClass.mvidlive, 'LIVE mismatch');
    CheckEquals(2017, fClass.mvidyear, 'Year mismatch');
    CheckEqualsString('EN', fClass.mvidlanguage, 'Language mismatch');
  finally
    fClass.Free;
  end;
end;

procedure TTestTMVIDRelease.TestTMVIDRelease8;
var
  fClass: TMVIDRelease;
  fSFV: String;
  fNFO: String;
  fFileCount: Integer;
  fGenres: TArray<String>;
  fVideoRegion: String;
begin
  fSFV := 'norte-pln1-complete.r00 dabc01f7' + #10 +
    'norte-pln1-complete.r01 4179eb4a' + #10 +
    'norte-pln1-complete.r02 4e144f4b' + #10 +
    'norte-pln1-complete.r03 0d29a527' + #10 +
    'norte-pln1-complete.r04 60cfa0fc' + #10 +
    'norte-pln1-complete.r05 23bc93f0' + #10 +
    'norte-pln1-complete.r06 560324da' + #10 +
    'norte-pln1-complete.r07 e4a21881' + #10 +
    'norte-pln1-complete.r08 2164e462' + #10 +
    'norte-pln1-complete.r09 7584bc5d' + #10 +
    'norte-pln1-complete.r10 b97815ac' + #10 +
    'norte-pln1-complete.r11 e5fa5c09' + #10 +
    'norte-pln1-complete.r12 bd06cc3f' + #10 +
    'norte-pln1-complete.r13 109b5a72' + #10 +
    'norte-pln1-complete.r14 c7547bbb' + #10 +
    'norte-pln1-complete.r15 f95b244d' + #10 +
    'norte-pln1-complete.r16 aa934cc1' + #10 +
    'norte-pln1-complete.r17 71274901' + #10 +
    'norte-pln1-complete.r18 a8e6edfb' + #10 +
    'norte-pln1-complete.r19 475098d0' + #10 +
    'norte-pln1-complete.r20 e194aad6' + #10 +
    'norte-pln1-complete.r21 d92f7039' + #10 +
    'norte-pln1-complete.r22 6c5fc100' + #10 +
    'norte-pln1-complete.r23 1b9e3e88' + #10 +
    'norte-pln1-complete.r24 b37fe26c' + #10 +
    'norte-pln1-complete.r25 4af45421' + #10 +
    'norte-pln1-complete.r26 aff1fae4' + #10 +
    'norte-pln1-complete.r27 0b77703a' + #10 +
    'norte-pln1-complete.r28 1bb85321' + #10 +
    'norte-pln1-complete.r29 adcd510b' + #10 +
    'norte-pln1-complete.r30 da44ac3a' + #10 +
    'norte-pln1-complete.r31 b3c45859' + #10 +
    'norte-pln1-complete.r32 22163b8c' + #10 +
    'norte-pln1-complete.r33 668114c1' + #10 +
    'norte-pln1-complete.r34 f878a359' + #10 +
    'norte-pln1-complete.r35 87fb3019' + #10 +
    'norte-pln1-complete.r36 fd151c5a' + #10 +
    'norte-pln1-complete.r37 2c7df42d' + #10 +
    'norte-pln1-complete.r38 42eee034' + #10 +
    'norte-pln1-complete.r39 2012bef2' + #10 +
    'norte-pln1-complete.r40 6ce4562a' + #10 +
    'norte-pln1-complete.r41 c4045bbc' + #10 +
    'norte-pln1-complete.r42 5abea59b' + #10 +
    'norte-pln1-complete.r43 6c065550' + #10 +
    'norte-pln1-complete.r44 869e43ee' + #10 +
    'norte-pln1-complete.r45 ef42324e' + #10 +
    'norte-pln1-complete.r46 05480563' + #10 +
    'norte-pln1-complete.r47 e379e8b6' + #10 +
    'norte-pln1-complete.r48 cdf698bf' + #10 +
    'norte-pln1-complete.rar 0daf78a6';

  fNFO := ' ' + #13#10 +
    '              - -------- - >> >  N  O  R  T  E  < << - -------- -' + #13#10 +
    '             __    ________________ _________  ___________ __________' + #13#10 +
    '      ----- .\\/\\   /    //_       //   __   / /          //        /:' + #13#10 +
    '      NORTE :/  \\ //   /  /      //_   )/__/_/ _/   ___ / / ____  / .' + #13#10 +
    '      ----- /  \\ \\/   /  / __   /_ /  __     / /    / \\/_/    //_/___ _' + #13#10 +
    '      ____ /    \\    /_ /  )/  // /   //    / /    / /     __/___ ___' + #13#10 +
    '       \\__/    / \\    //   /   / /   //    /_/_   / /           /__/' + #13#10 +
    '       <_/___ /   \\  //_________\\___//____/_\\__\\_/ /___________//__>' + #13#10 +
    '     <<----------- \\/ ---------------------------------<zNr/dS!>----------->>' + #13#10 +
    '   ' + #13#10 +
    '     RELEASE INFO ::' + #13#10 +
    ' ' + #13#10 +
    '     Artist........: Pimpinela' + #13#10 +
    '     Album.........: Las Numero 1' + #13#10 +
    '     Genre.........: Pop' + #13#10 +
    '     SubGenre......: Latin pop, Latin, Ballad' + #13#10 +
    '     Year..........: 2006' + #13#10 +
    '     Language .....: Spanish' + #13#10 +
    '     Cat. Number...: 886970407526' + #13#10 +
    '     Label ........: SONY BMG Music Entertainment' + #13#10 +
    '     Runtime.......: 00:45:04' + #13#10 +
    '     Files.........: 50x50 MB' + #13#10 +
    '     Format........: .ISO' + #13#10 +
    '     Audio.........: AC-3 2.0 @ 192 kbps ' + #13#10 +
    '     Video.........: Untouched' + #13#10 +
    '     Source........: NTSC DVD5' + #13#10 +
    '     Menu..........: Untouched' + #13#10 +
    '     Extras........: None' + #13#10 +
    '     Subs..........: None' + #13#10 +
    '     URL...........: http://www.pimpinela.net/' + #13#10 +
    '     https://www.discogs.com/es/Pimpinela-Las-Numero-1/release/11261171' + #13#10 +
    '     TRACK LIST ::        ' + #13#10 +
    ' ' + #13#10 +
    '     01.Olvidame Y Pega La Vuelta                                       03:02' + #13#10 +
    '     02.Dimelo Delante De Ella                                          02:33' + #13#10 +
    '     03.Vivir Sin Ti No Puedo                                           03:13' + #13#10 +
    '     04.En Lo Bueno Y En Lo Malo                                        03:38' + #13#10 +
    '     05.Valiente                                                        03:26' + #13#10 +
    '     06.Ese Estupido Que Llama                                          03:42' + #13#10 +
    '     07.Ahora Decide                                                    03:22' + #13#10 +
    '     08.Una Estupida Mas                                                02:27' + #13#10 +
    '     09.Maria Morena                                                    03:40' + #13#10 +
    '     10.A Esa                                                           03:01' + #13#10 +
    '     11.Tomame                                                          03:58' + #13#10 +
    '     12.Me Hace Falta Una Flor                                          04:12' + #13#10 +
    '     13.Cuanto Te Quiero                                                04:50' + #13#10 +
    '     RELEASE NOTES ::' + #13#10 +
    '     Pimpinela ha editado veinticuatro discos por los que han recibido 95' + #13#10 +
    '     discos entre oro, platino y diamante. Han vendido mas de treinta' + #13#10 +
    '     millones de discos en todo el mundo y han participado en los mas' + #13#10 +
    '     lujosos escenarios como el Madison Square Garden, en el cual' + #13#10 +
    '     solamente el cantante argentino Sandro, el guitarrista Pappo y ellos' + #13#10 +
    '     han actuado con esta nacionalidad. Sus temas cuentan con versiones' + #13#10 +
    '     en ingles, italiano y portugues.' + #13#10 +
    ' ' + #13#10 +
    '     Enjoy another fine release from Team NORTE!' + #13#10 +
    '                                                                      ' + #13#10 +
    '     <<---------------------------( Since 2019 )--------------------------->>';

  fFileCount := TPazoMVIDTask.GetFileCountFromSFV(fSFV);
  fGenres := TPazoMVIDTask.TryToParseGenre(fNFO);
  fVideoRegion := TPazoMVIDTask.ParseVideoRegion(fNFO);

  fClass := TMVIDRelease.Create('Pimpinela.Las.Numero.1.2006.ES.NTSC.BONUS.COMPLETE.INTERNAL.MDVDR-NORTE', 'MDVDR');
  try
    fClass.SetValuesFromTask(fFileCount, (fVideoRegion = 'PAL'), (fVideoRegion = 'NTSC'), fGenres);

    CheckEquals(50, fClass.mvidfiles, 'Filecount mismatch');
    CheckEqualsString('Ballad,Latin,Pop', fClass.mvidgenre.CommaText, 'genre mismatch');
    CheckFalse(fClass.mvidpal, 'PAL mismatch');
    CheckTrue(fClass.mvidntsc, 'NTSC mismatch');
    CheckFalse(fClass.mvidva, 'Various Artists mismatch');
    CheckFalse(fClass.mvidlive, 'LIVE mismatch');
    CheckEquals(2006, fClass.mvidyear, 'Year mismatch');
    CheckEqualsString('ES', fClass.mvidlanguage, 'Language mismatch');
  finally
    fClass.Free;
  end;
end;
{
procedure TTestTMVIDRelease.TestTMVIDRelease9;
var
  fClass: TMVIDRelease;
  fSFV: String;
  fNFO: String;
  fFileCount: Integer;
  fGenres: TArray<String>;
  fVideoRegion: String;
begin
  fFileCount := TPazoMVIDTask.GetFileCountFromSFV(fSFV);
  fGenres := TPazoMVIDTask.TryToParseGenre(fNFO);
  fVideoRegion := TPazoMVIDTask.ParseVideoRegion(fNFO);

  fClass := TMVIDRelease.Create('Krabathor.Rebirth.Of.Brutality.Live.In.Uherske.Hradiste.2015.PAL.2DiSC.BONUS.MDVDR-AURORA', 'MDVDR');
  try
    fClass.SetValuesFromTask(fFileCount, (fVideoRegion = 'PAL'), (fVideoRegion = 'NTSC'), fGenres);

    CheckEquals(50, fClass.mvidfiles, 'Filecount mismatch');
    CheckEqualsString('x,y,z', fClass.mvidgenre.CommaText, 'genre mismatch');
    CheckTrue(fClass.mvidpal, 'PAL mismatch');
    CheckFalse(fClass.mvidntsc, 'NTSC mismatch');
    CheckFalse(fClass.mvidva, 'Various Artists mismatch');
    CheckTrue(fClass.mvidlive, 'LIVE mismatch');
    CheckEquals(2015, fClass.mvidyear, 'Year mismatch');
    CheckEqualsString('EN', fClass.mvidlanguage, 'Language mismatch');
  finally
    fClass.Free;
  end;
end;
}
procedure TTestTMVIDRelease.TestTMVIDRelease10;
var
  fClass: TMVIDRelease;
  fSFV: String;
  fNFO: String;
  fFileCount: Integer;
  fGenres: TArray<String>;
  fVideoRegion: String;
begin
  fSFV := 'ruil-tsmmlvdvd9.r00 806dfaaa' + #10 +
    'ruil-tsmmlvdvd9.r01 bfe50c30' + #10 +
    'ruil-tsmmlvdvd9.r02 e2cc1714' + #10 +
    'ruil-tsmmlvdvd9.r03 926e7d8a' + #10 +
    'ruil-tsmmlvdvd9.r04 7decc18f' + #10 +
    'ruil-tsmmlvdvd9.r05 6c591ff7' + #10 +
    'ruil-tsmmlvdvd9.r06 08424905' + #10 +
    'ruil-tsmmlvdvd9.r07 baf7ded4' + #10 +
    'ruil-tsmmlvdvd9.r08 02704f26' + #10 +
    'ruil-tsmmlvdvd9.r09 b52f2ef3' + #10 +
    'ruil-tsmmlvdvd9.r10 3956078c' + #10 +
    'ruil-tsmmlvdvd9.r11 c84de101' + #10 +
    'ruil-tsmmlvdvd9.r12 0cc486c8' + #10 +
    'ruil-tsmmlvdvd9.r13 ccee6b09' + #10 +
    'ruil-tsmmlvdvd9.r14 b030afe7' + #10 +
    'ruil-tsmmlvdvd9.r15 7559477f' + #10 +
    'ruil-tsmmlvdvd9.r16 ffa32c41' + #10 +
    'ruil-tsmmlvdvd9.r17 62730c00' + #10 +
    'ruil-tsmmlvdvd9.r18 ed5eba9e' + #10 +
    'ruil-tsmmlvdvd9.r19 f0824f7e' + #10 +
    'ruil-tsmmlvdvd9.r20 de7a63f0' + #10 +
    'ruil-tsmmlvdvd9.r21 ea7f6500' + #10 +
    'ruil-tsmmlvdvd9.r22 5b1e8f71' + #10 +
    'ruil-tsmmlvdvd9.r23 ca14390f' + #10 +
    'ruil-tsmmlvdvd9.r24 a00ffb46' + #10 +
    'ruil-tsmmlvdvd9.r25 675ca04b' + #10 +
    'ruil-tsmmlvdvd9.r26 f5de64ef' + #10 +
    'ruil-tsmmlvdvd9.r27 f893de7e' + #10 +
    'ruil-tsmmlvdvd9.r28 352574fb' + #10 +
    'ruil-tsmmlvdvd9.r29 d0b21ce2' + #10 +
    'ruil-tsmmlvdvd9.r30 81439b9d' + #10 +
    'ruil-tsmmlvdvd9.r31 38c6d8a4' + #10 +
    'ruil-tsmmlvdvd9.r32 7f37ed72' + #10 +
    'ruil-tsmmlvdvd9.r33 3ba26e91' + #10 +
    'ruil-tsmmlvdvd9.r34 9ca01cf5' + #10 +
    'ruil-tsmmlvdvd9.r35 73c02ac7' + #10 +
    'ruil-tsmmlvdvd9.r36 66785ca9' + #10 +
    'ruil-tsmmlvdvd9.r37 701770ec' + #10 +
    'ruil-tsmmlvdvd9.r38 bc58a43c' + #10 +
    'ruil-tsmmlvdvd9.r39 0cc3e8ec' + #10 +
    'ruil-tsmmlvdvd9.r40 2cb4e70d' + #10 +
    'ruil-tsmmlvdvd9.r41 6e891536' + #10 +
    'ruil-tsmmlvdvd9.r42 9db2bca3' + #10 +
    'ruil-tsmmlvdvd9.r43 5639d2ce' + #10 +
    'ruil-tsmmlvdvd9.r44 9f892835' + #10 +
    'ruil-tsmmlvdvd9.r45 9bc4033a' + #10 +
    'ruil-tsmmlvdvd9.r46 42173956' + #10 +
    'ruil-tsmmlvdvd9.r47 b9a8bb81' + #10 +
    'ruil-tsmmlvdvd9.r48 3811483b' + #10 +
    'ruil-tsmmlvdvd9.r49 41314858' + #10 +
    'ruil-tsmmlvdvd9.r50 4ceef6cb' + #10 +
    'ruil-tsmmlvdvd9.r51 ca901e6b' + #10 +
    'ruil-tsmmlvdvd9.r52 e4de88dd' + #10 +
    'ruil-tsmmlvdvd9.r53 dc69be51' + #10 +
    'ruil-tsmmlvdvd9.r54 1196c296' + #10 +
    'ruil-tsmmlvdvd9.r55 5bfd2f3b' + #10 +
    'ruil-tsmmlvdvd9.r56 b85b1533' + #10 +
    'ruil-tsmmlvdvd9.r57 9b64f745' + #10 +
    'ruil-tsmmlvdvd9.r58 a788fed7' + #10 +
    'ruil-tsmmlvdvd9.r59 9586584e' + #10 +
    'ruil-tsmmlvdvd9.r60 4e91a5fb' + #10 +
    'ruil-tsmmlvdvd9.r61 3d774a8a' + #10 +
    'ruil-tsmmlvdvd9.r62 7388f9b7' + #10 +
    'ruil-tsmmlvdvd9.r63 7fb91d3e' + #10 +
    'ruil-tsmmlvdvd9.r64 4d435ac1' + #10 +
    'ruil-tsmmlvdvd9.r65 81470791' + #10 +
    'ruil-tsmmlvdvd9.r66 e685ec82' + #10 +
    'ruil-tsmmlvdvd9.r67 034bce6f' + #10 +
    'ruil-tsmmlvdvd9.r68 8e3db012' + #10 +
    'ruil-tsmmlvdvd9.r69 4b9c7521' + #10 +
    'ruil-tsmmlvdvd9.r70 ea6e24fb' + #10 +
    'ruil-tsmmlvdvd9.r71 2a2930a4' + #10 +
    'ruil-tsmmlvdvd9.r72 4be3c5d8' + #10 +
    'ruil-tsmmlvdvd9.r73 b5ced6f9' + #10 +
    'ruil-tsmmlvdvd9.r74 b2a7a0b2' + #10 +
    'ruil-tsmmlvdvd9.r75 3cdf14d1' + #10 +
    'ruil-tsmmlvdvd9.r76 231ba6a4' + #10 +
    'ruil-tsmmlvdvd9.r77 b5becad2' + #10 +
    'ruil-tsmmlvdvd9.r78 1e1e8e5b' + #10 +
    'ruil-tsmmlvdvd9.r79 7abc64fd' + #10 +
    'ruil-tsmmlvdvd9.rar 36086b9e';

  fNFO := '                        RUiL PROUDLY PRESENTS   ' + #10 +
    '___________    ______   _____      ____________  _____                      ' + #10 +
    '\\          \\   \\     \\  \\    \\    /            \\|\\    \\                     ' + #10 +
    ' \\    /\\    \\   \\    |  |    |   |\\___/\\  \\\\___/|\\\\    \\                    ' + #10 +
    '  |   \\_\\    |   |   |  |    |    \\|____\\  \\___|/ \\\\    \\                   ' + #10 +
    '  |      ___/    |    \\_/   /|          |  |       \\|    | ______           ' + #10 +
    '  |      \\  ____ |\\         \\|     __  /   / __     |    |/      \\          ' + #10 +
    ' /     /\\ \\/    \\| \\         \\__  /  \\/   /_/  |    /            |          ' + #10 +
    '/_____/ |\\______| \\ \\_____/\\    \\|____________/|   /_____/\\_____/|          ' + #10 +
    '|     | | |     |  \\ |    |/___/||           | /  |      | |    ||          ' + #10 +
    '|_____|/ \\|_____|   \\|____|   | ||___________|/   |______|/|____|/          ' + #10 +
    '                          |___|/                                            ' + #10 +
    '        ___________         ____________  _______    ______ ____________    ' + #10 +
    '       /           \\        \\           \\ \\      |  |      |\\           \\   ' + #10 +
    '      /    _   _    \\        \\           \\ |     /  /     /| \\           \\  ' + #10 +
    '     /    //   \\\\    \\        |    /\\     ||\\    \\  \\    |/   |    /\\     | ' + #10 +
    '    /    //     \\\\    \\       |   |  |    |\\ \\    \\ |    |    |   |  |    | ' + #10 +
    '   /     \\\\_____//     \\      |    \\/     | \\|     \\|    |    |    \\/     | ' + #10 +
    '  /       \\ ___ /       \\    /           /|  |\\         /|   /           /| ' + #10 +
    ' /________/|   |\\________\\  /___________/ |  | \\_______/ |  /___________/ | ' + #10 +
    '|        | |   | |        ||           | /    \\ |     | /  |           | /  ' + #10 +
    '|________|/     \\|________||___________|/      \\|_____|/   |___________|/   ' + #10 +
    '                                                                            ' + #10 +
    '        RLSNAME ...........: Twisted.Sister.Metal.Meltdown.Live.From.The.Hard.Rock.Casino.Las.Vegas.2016.DVD9.NTSC.MDVDR-RUiL' + #10 +
    '        ARTiST ............: Twisted Sister' + #10 +
    '        TiTLE .............: Metal Meltdown Live From The Hard Rock Casino Las Vegas' + #10 +
    '        GENRE .............: Heavy Metal' + #10 +
    '        YEAR ..............: 2016' + #10 +
    '        LABEL .............: Rock Fuel Media Inc.' + #10 +
    '        CATNR .............: LNPD29' + #10 +
    '        LiNK ..............: http://www.discogs.com/release/8929931' + #10 +
    '        ViDEO SOURCE ......: DVD9' + #10 +
    '        QUALiTY ...........: UNTOUCHED' + #10 +
    '        ViDEO STD .........: NTSC' + #10 +
    '        AUDiO .............: DD2.0 / DD5.1' + #10 +
    '        QUALiTY ...........: 192 kbps / 448 kbps' + #10 +
    '        IMG SiZE ..........: 7.47GB' + #10 +
    '        ARCHiVES ..........: 81x100MB' + #10 +
    '		RIPPER ............: RUiL' + #10 +
    '        RIP DATE ..........: 2020-06-11' + #10 +
    '        iNFO:' + #10 +
    '        Recorded live at the Joint at Hard Rock Hotel, Las Vegas, NV, USA, 30/04/2015' + #10 +
    '		Three hours Twisted Sister dedicated to the memory of A.J. Pero' + #10 +
    '		' + #10 +
    '		METAL MELTDOWN LIVE:' + #10 +
    '		-----------------------------------------------' + #10 +
    '		What You Don''t Know' + #10 +
    '		The Kids Are Back' + #10 +
    '		Stay Hungry' + #10 +
    '		The Beast' + #10 +
    '		Shoot ''Em Down' + #10 +
    '		You Can''t Stop Rock ''N'' Roll' + #10 +
    '		I Believe In Rock ''N'' Roll' + #10 +
    '		I Am (I''m Me)' + #10 +
    '		Under The Blade' + #10 +
    '		We''re Not Gonna Take It' + #10 +
    '		The Fire Still Burns' + #10 +
    '		The Price' + #10 +
    '		Burn In Hell' + #10 +
    '		A. J. Pero Tribute' + #10 +
    '		I Wanna Rock' + #10 +
    '		Come Out And Play' + #10 +
    '		S.M.F.' + #10 +
    '        BONUS MATERIAL:' + #10 +
    '        -----------------------------------------------' + #10 +
    '        Interviews / Documentary' + #10 +
    '        GROUP iNFO' + #10 +
    '        ----------' + #10 +
    '        KEEP IT REAL!!!!' + #10 +
    '        ';

  fFileCount := TPazoMVIDTask.GetFileCountFromSFV(fSFV);
  fGenres := TPazoMVIDTask.TryToParseGenre(fNFO);
  fVideoRegion := TPazoMVIDTask.ParseVideoRegion(fNFO);

  fClass := TMVIDRelease.Create('Twisted.Sister.Metal.Meltdown.Live.From.The.Hard.Rock.Casino.Las.Vegas.2016.DVD9.NTSC.MDVDR-RUiL', 'MDVDR');
  try
    fClass.SetValuesFromTask(fFileCount, (fVideoRegion = 'PAL'), (fVideoRegion = 'NTSC'), fGenres);

    CheckEquals(81, fClass.mvidfiles, 'Filecount mismatch');
    CheckEqualsString('Heavy,Metal', fClass.mvidgenre.CommaText, 'genre mismatch');
    CheckFalse(fClass.mvidpal, 'PAL mismatch');
    CheckTrue(fClass.mvidntsc, 'NTSC mismatch');
    CheckFalse(fClass.mvidva, 'Various Artists mismatch');
    CheckTrue(fClass.mvidlive, 'LIVE mismatch');
    CheckEquals(2016, fClass.mvidyear, 'Year mismatch');
    CheckEqualsString('EN', fClass.mvidlanguage, 'Language mismatch');
  finally
    fClass.Free;
  end;
end;

procedure TTestTMVIDRelease.TestTMVIDRelease11;
var
  fClass: TMVIDRelease;
  fSFV: String;
  fNFO: String;
  fFileCount: Integer;
  fGenres: TArray<String>;
  fVideoRegion: String;
begin
  fSFV := 'hfpa-bohemian.rhapsody.live.aid2160p.r00 7d00eea2' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r01 a0782f41' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r02 601d663c' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r03 960edc1d' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r04 bde95e7b' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r05 3ab5cfb8' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r06 689080e3' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r07 2c8cda22' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r08 aaced52e' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r09 1ed277c3' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r10 66e24bc7' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r11 7cdb91bd' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r12 5ee25773' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r13 f244cc3b' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r14 57a1cb43' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r15 a5b14b7e' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r16 91cc3a97' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r17 b99f1dc9' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r18 390bce80' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r19 a0d99ed5' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r20 4b62b4a6' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r21 794c7860' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r22 b6211353' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r23 bdbaeafc' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r24 15364c8b' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r25 36b87fea' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r26 ccdfff65' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r27 d4501b1d' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r28 8ba54e4e' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r29 3ebac1a1' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r30 84870f32' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r31 c7921585' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r32 e8fa04b5' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r33 ec9762f1' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r34 1a09829c' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r35 3342b2aa' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r36 0db54c30' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r37 82cc6b28' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r38 1f890f15' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r39 d8aa2538' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r40 928d33e6' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r41 04bfa934' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r42 201810c2' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r43 e36f2f54' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r44 9c9d796e' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r45 27978308' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r46 6e8e9b30' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r47 dcf99dd1' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r48 aa25afab' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r49 1582637a' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r50 a7de53e7' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r51 0cb7b4eb' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r52 28dac29c' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r53 aa2c834c' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r54 fee8be62' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r55 c3439e04' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r56 aca564ae' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r57 e9fe533c' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r58 92539b11' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r59 cfa75f55' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r60 69ac83db' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r61 76dc0228' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r62 4037580e' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r63 33a70b35' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r64 fbe98610' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r65 272a5399' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r66 ca4fcce0' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r67 92a64b08' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r68 dcc4d250' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r69 30908421' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r70 4fd9ef2e' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r71 e6f2816d' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r72 10bef821' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r73 70ba10e8' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r74 8b09fc11' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r75 e694f046' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r76 f1c6701e' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r77 7427c2f0' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r78 081ec4f7' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r79 f531f2ee' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r80 9664f7d4' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r81 6c07df46' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r82 e99d463d' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r83 7e6c2b31' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r84 27eb10e4' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r85 2132983f' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r86 480619a8' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r87 0ddc86a8' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.r88 21287d61' + #13#10 +
    'hfpa-bohemian.rhapsody.live.aid2160p.rar 0f65a5e3';

  fNFO := ' _   _      _____           ____         _     ' + #13#10 +
    '| | | |    |___  |         / _  |       / \\    ' + #13#10 +
    '| |_| |       _| |        | (_| |      / _ \\   ' + #13#10 +
    '|  _  |      |_  |         \\__  |     / ___ \\  ' + #13#10 +
    '|_| |_|igh     |_|idelity     |_|ure /_/   \\_\\udio ' + #13#10 +
    '                                  ' + #13#10 +
    'RELEASE         : Bohemian.Rhapsody.The.Complete.Live.Aid.Movie.Performance.2018.EXTRAS.2160p.UHD.MBluRay.x265-HFPA' + #13#10 +
    'DATE            : 2020/06/29' + #13#10 +
    'GENRE           : Rock' + #13#10 +
    'RUNTIME         : 22min' + #13#10 +
    'AUDIO           : [ATMOS   |   7.1]   [ 8331Kbps]' + #13#10 +
    '                : [AC3     |   5.1]   [  640Kbps]' + #13#10 +
    'SOURCE          : [35.195Kb/s]' + #13#10 +
    'BITRATE         : [19.129Kb/s]' + #13#10 +
    'CRF             : [15]' + #13#10 +
    'VIDEO           : [3840    |  1604]' + #13#10 +
    'SUBS            : [en | sp | fr | sp | dk | nl | fi | de | it | no | se | cn | cz | kr | cn | pl]' + #13#10 +
    'IMDB            : [n/a]' + #13#10 +
    'RATING          : [n/a]	' + #13#10 +
    'COMMENT         : Enjoy!' + #13#10 +
    '                  This comes as an extra on the 4K/Bluray. The Complete Live Aid Movie Performance offers the ' + #13#10 +
    '                  film''s full recreation of the iconic concert by Queen.' + #13#10 +
    '                  Tagged it MBluRay since it''s a recreation of the original thing (which was a concert obviously)' + #13#10 +
    '                  01. Bohemian Rhapsody (first half only)' + #13#10 +
    '                  02. Radio Ga Ga.' + #13#10 +
    '                  03. Ay‐Oh (vocal improvisation)' + #13#10 +
    '                  04. Hammer To Fall.' + #13#10 +
    '                  05. Crazy Little Thing Called Love.' + #13#10 +
    '                  06. We Will Rock You (first verse and chorus only)' + #13#10 +
    '                  07. We Are The Champions.';

  fFileCount := TPazoMVIDTask.GetFileCountFromSFV(fSFV);
  fGenres := TPazoMVIDTask.TryToParseGenre(fNFO);
  fVideoRegion := TPazoMVIDTask.ParseVideoRegion(fNFO);

  fClass := TMVIDRelease.Create('Bohemian.Rhapsody.The.Complete.Live.Aid.Movie.Performance.2018.2160p.UHD.MBluRay.x265-HFPA', 'MBLURAY');
  try
    fClass.SetValuesFromTask(fFileCount, (fVideoRegion = 'PAL'), (fVideoRegion = 'NTSC'), fGenres);

    CheckEquals(90, fClass.mvidfiles, 'Filecount mismatch');
    CheckEqualsString('Rock', fClass.mvidgenre.CommaText, 'genre mismatch');
    CheckFalse(fClass.mvidpal, 'PAL mismatch');
    CheckFalse(fClass.mvidntsc, 'NTSC mismatch');
    CheckFalse(fClass.mvidva, 'Various Artists mismatch');
    CheckFalse(fClass.mvidlive, 'LIVE mismatch');
    CheckEquals(2018, fClass.mvidyear, 'Year mismatch');
    CheckEqualsString('EN', fClass.mvidlanguage, 'Language mismatch');
  finally
    fClass.Free;
  end;
end;

procedure TTestTMVIDRelease.TestTMVIDRelease12;
var
  fClass: TMVIDRelease;
  fSFV: String;
  fNFO: String;
  fFileCount: Integer;
  fGenres: TArray<String>;
  fVideoRegion: String;
begin
  fSFV := 'ea-bqbeethovenstringquartets_d1.r00 0675cbc6' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r01 642e3a72' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r02 1fddbcd5' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r03 39ed330d' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r04 77a4090d' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r05 ad57c6fc' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r06 d452f71e' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r07 b20f86fc' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r08 a31852be' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r09 a97bdf2c' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r10 bcc55706' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r11 9c0cf6d8' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r12 2265dbbf' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r13 506b25cd' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r14 c97bc0c1' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r15 4f3284a2' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r16 4f70d74f' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r17 5d000053' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r18 428b309f' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r19 50ffbeb8' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r20 19f4e163' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r21 2e7fb4f0' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r22 2b411fa7' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r23 93318b2f' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r24 2d080ca2' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r25 39e62c8b' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r26 c1159593' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r27 520c1480' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r28 67b247df' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r29 2123298a' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r30 644d808f' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r31 8889cef5' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r32 a7acb3ae' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r33 f3657844' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r34 b27bd8cd' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r35 5dfc8542' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r36 10070aa1' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r37 7483e00b' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r38 92c108ed' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r39 7083d448' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r40 16524711' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r41 386f982b' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r42 a4b4cb12' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r43 a7eea62c' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r44 2096c0fe' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r45 e57f2dd2' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r46 0ccd78ca' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r47 7d9f1414' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r48 e459a96f' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r49 3063bcec' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r50 e81b7f61' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r51 9194bf50' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r52 85473f87' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r53 0e3ccd00' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r54 1e8dd6bd' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r55 74cc6174' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r56 a0d344c0' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r57 4e8b6514' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r58 40b4b912' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r59 4b8f0cda' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r60 562ea851' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.r61 a768868b' + #13#10 +
    'ea-bqbeethovenstringquartets_d1.rar ffabb1db';

  fNFO := 'ooooooooooo                                       o                   o8               ' + #13#10 +
    ' 888    88 oooo  oooo  oo oooooo     ooooooo     888     oo oooooo  o888oo  oooooooo8  ' + #13#10 +
    ' 888ooo8    888   888   888    888 888     888  8  88     888    888 888   888ooooooo  ' + #13#10 +
    ' 888    oo  888   888   888        888     888 8oooo88    888        888           888 ' + #13#10 +
    'o888ooo8888  888o88 8o o888o         88ooo88 o88o  o888o o888o        888o 88oooooo88 ' + #13#10 +
    '     Presents' + #13#10 +
    ' ' + #13#10 +
    '        Belcea Quartet: Beethoven - The Complete String Quartets' + #13#10 +
    'Release Date............... 29.06.2020' + #13#10 +
    'Store Date................. 26.06.2020' + #13#10 +
    'Production................. EuroArts' + #13#10 +
    'Genre ..................... Classical music, Musicals, Concert' + #13#10 +
    'Runtime ................... 139 min' + #13#10 +
    'Source .................... BD50' + #13#10 +
    'Audio ..................... Instrumental DTS-HD MA 5.1' + #13#10 +
    '     Instrumental PCM 2.0' + #13#10 +
    'Subtitles ................. German, English, French' + #13#10 +
    'Videoformat................ 1920x1080i (1.78:1)' + #13#10 +
    'Size ...................... 63 X 500 MB' + #13#10 +
    'iMDB Rating ............... --' + #13#10 +
    'iMDB Link ................. http://imdb.com/title/tt5314058' + #13#10 +
    'Extra nfo ................. https://amzn.to/2ZkElar';

  fFileCount := TPazoMVIDTask.GetFileCountFromSFV(fSFV);
  fGenres := TPazoMVIDTask.TryToParseGenre(fNFO);
  fVideoRegion := TPazoMVIDTask.ParseVideoRegion(fNFO);

  fClass := TMVIDRelease.Create('Belcea.Quartet.Beethoven.The.Complete.String.Quartets.DiSC.1.2012.COMPLETE.MBLURAY-EUROARTS', 'MBLURAY');
  try
    fClass.SetValuesFromTask(fFileCount, (fVideoRegion = 'PAL'), (fVideoRegion = 'NTSC'), fGenres);

    CheckEquals(63, fClass.mvidfiles, 'Filecount mismatch');
    CheckEqualsString('Classical,Concert,music,Musicals', fClass.mvidgenre.CommaText, 'genre mismatch');
    CheckFalse(fClass.mvidpal, 'PAL mismatch');
    CheckFalse(fClass.mvidntsc, 'NTSC mismatch');
    CheckFalse(fClass.mvidva, 'Various Artists mismatch');
    CheckFalse(fClass.mvidlive, 'LIVE mismatch');
    CheckEquals(2012, fClass.mvidyear, 'Year mismatch');
    CheckEqualsString('EN', fClass.mvidlanguage, 'Language mismatch');
  finally
    fClass.Free;
  end;
end;

procedure TTestTMVIDRelease.TestTMVIDRelease13;
var
  fClass: TMVIDRelease;
  fSFV: String;
  fNFO: String;
  fFileCount: Integer;
  fGenres: TArray<String>;
  fVideoRegion: String;
begin
  fSFV := 'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r00 0387437a' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r01 9fa45c2a' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r02 506267de' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r03 335aacf6' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r04 45a14dd0' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r05 ccbba165' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r06 11d029a1' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r07 8ab84869' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r08 2b2a7d55' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r09 8e294cab' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r10 1cb41af3' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r11 f5979163' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r12 2308a3ae' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r13 a6b1035f' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r14 eec07fc1' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r15 0c298e4d' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r16 3b68cc4b' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r17 9c46c779' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r18 d188731e' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r19 d57da542' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r20 4b4c7f6e' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r21 53250efa' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r22 8b93146b' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r23 4f7f1377' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r24 e5f163c0' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r25 3f6de128' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r26 e1f9f525' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r27 bc8a7336' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r28 34739f3e' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r29 ae24c291' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r30 52791d79' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r31 03d0ff4f' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r32 f8587acf' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r33 a97615ef' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r34 5a00ba67' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r35 aa9fea6a' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r36 56330b68' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r37 54507b92' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r38 745ac310' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r39 e6eb66b3' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r40 2547522e' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r41 7584eb46' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r42 b51b9605' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r43 c039b424' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r44 59023fa6' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r45 c56668a9' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r46 9eb0a1b4' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r47 0a0ad282' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r48 0ec30f4c' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r49 fa027128' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.r50 ac1ae209' + #13#10 +
    'new.years.eve.concert.2019.2020.720p.mbluray.x264-mblurayfans.rar 1cb430ff';

  fNFO := '                _____ __________.____     ____ _____________    _____ _____.___.' + #13#10 +
    '               /     \\\\______   \\    |   |    |   \\______   \\  /  _  \\\\__  |   |' + #13#10 +
    '              /  \\ /  \\|    |  _/    |   |    |   /|       _/ /  /_\\  \\/   |   |' + #13#10 +
    '             /    Y    \\    |   \\    |___|    |  / |    |   \\/    |    \\____   |' + #13#10 +
    '             \\____|__  /______  /_______ \\______/  |____|_  /\\____|__  / ______|' + #13#10 +
    '                     \\/       \\/        \\/                \\/         \\/\\/' + #13#10 +
    '					 ' + #13#10 +
    '					 ' + #13#10 +
    '				    	 ________________    _______    _________' + #13#10 +
    '                         \\_   _____/  _  \\   \\      \\  /   _____/' + #13#10 +
    '                          |    __)/  /_\\  \\  /   |   \\ \\_____  \\ ' + #13#10 +
    '                          |     \\/    |    \\/    |    \\/        \\' + #13#10 +
    '                          \\___  /\\____|__  /\\____|__  /_______  /' + #13#10 +
    '                              \\/         \\/         \\/        \\/ ' + #13#10 +
    '	  ' + #13#10 +
    '	  ' + #13#10 +
    '	                                     i S' + #13#10 +
    '	  ' + #13#10 +
    '	                            - P R E S E N T i N G -' + #13#10 +
    '								' + #13#10 +
    '								' + #13#10 +
    '								' + #13#10 +
    '								' + #13#10 +
    '            New.Years.Eve.Concert.2019.2020.720p.MBLURAY.x264-MBLURAYFANS' + #13#10 +
    '		  ' + #13#10 +
    '		  ' + #13#10 +
    '             Title ...... =  New Years Eve Concert 2019' + #13#10 +
    '             Runtime .... =  106 Minuten                   ' + #13#10 +
    '             Video .....  =  1280 x 720 - x264 - crf17 - 5778 kb/s (source 21.5mb/s)' + #13#10 +
    '             Audio ...... =  English AC3 5.0 @ 640 kbps' + #13#10 +
    '             Size ....... =  4871 MB' + #13#10 +
    '			 Subs ....... =  ENG DE JAP KOR' + #13#10 +
    '             Link ....... =  https://www.berliner-philharmoniker.de/en/titelgeschichten/20192020/2019-new-years-eve-concert/' + #13#10 +
    '             Votes ...... =  -     ' + #13#10 +
    '	  ' + #13#10 +
    '	  ' + #13#10 +
    '                 _____ _____ _____ _ _____    _ _____    _____ _____ _____ ' + #13#10 +
    '                |     |  |  |   __|_|     |  |_|   __|  |     |  |  | __  |' + #13#10 +
    '                | | | |  |  |__   | |   --|  | |__   |  |  |  |  |  |    -|' + #13#10 +
    '			    |_|_|_|_____|_____|_|_____|  |_|_____|  |_____|_____|__|__|' + #13#10 +
    '                                                                     ' + #13#10 +
    '                                                  ' + #13#10 +
    '                                   __    _ _____ _____ ' + #13#10 +
    '                                  |  |  |_|   __|   __|' + #13#10 +
    '                                  |  |__| |   __|   __|' + #13#10 +
    '                                  |_____|_|__|  |_____|' + #13#10 +
    '								' + #13#10 +
    '	' + #13#10 +
    '                  _______ _______   _______ _______ _____  ___ ___   __ ' + #13#10 +
    '                 |    ___|    |  | |       |    |  |     ||   |   | |  |' + #13#10 +
    '                 |    ___|       | |   -   |       |       \\     /  |__|' + #13#10 +
    '                 |_______|__|____| |_______|__|____|_______||___|   |__|';

  fFileCount := TPazoMVIDTask.GetFileCountFromSFV(fSFV);
  fGenres := TPazoMVIDTask.TryToParseGenre(fNFO);
  fVideoRegion := TPazoMVIDTask.ParseVideoRegion(fNFO);

  fClass := TMVIDRelease.Create('New.Years.Eve.Concert.2019.2020.720p.MBLURAY.x264-MBLURAYFANS', 'MBLURAY');
  try
    fClass.SetValuesFromTask(fFileCount, (fVideoRegion = 'PAL'), (fVideoRegion = 'NTSC'), fGenres);

    CheckEquals(52, fClass.mvidfiles, 'Filecount mismatch');
    CheckEqualsString('', fClass.mvidgenre.CommaText, 'genre mismatch');
    CheckFalse(fClass.mvidpal, 'PAL mismatch');
    CheckFalse(fClass.mvidntsc, 'NTSC mismatch');
    CheckFalse(fClass.mvidva, 'Various Artists mismatch');
    CheckFalse(fClass.mvidlive, 'LIVE mismatch');
    CheckEquals(2020, fClass.mvidyear, 'Year mismatch');
    CheckEqualsString('EN', fClass.mvidlanguage, 'Language mismatch');
  finally
    fClass.Free;
  end;
end;

procedure TTestTMVIDRelease.TestTMVIDRelease14;
var
  fClass: TMVIDRelease;
  fSFV: String;
  fNFO: String;
  fFileCount: Integer;
  fGenres: TArray<String>;
  fVideoRegion: String;
begin
  fSFV := 'va-tribute_to_george_michael_(2017_bet_awards)-720p-x264-2017-srpx.mkv 75029cc0';

  fNFO := 'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ            ß    ÜÜ                            ÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ      Ü   Ü     Û°²Û                           ÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿ  ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ          Û Û     ßß  Ü                         ÿÿ' + #13#10 +
    'ÿÿÿÿÿÿ Þßÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ    ÜÜÜ    ß                  ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿ ßÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ  Û °±Û  Ü       Û     Ü     ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ  ÿÿÿÿÿÿ  Û°±²Û      Ü     Ü  Û²Û    ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ Þßÿÿÿÿÿÿ   ßßß      Û²Û        ß     ÿÿÿÿÿÿÿÿÿÿÜÿÿÿÿÿÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿ  ÿÿÿ ßÿÿÿÿÿÿÿ    ß   Ü    ß  Ü   Ü        ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿ Þßÿÿÿÿÿÿÿÿÿÿÿÿ           ß      ß          ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿ ßÿÿÿÿÿÿÿÿÿÿÿÿÿ ÿÜÛÛßßßßÛÛÛÛßÛÛÛÛÛÛßßßÛÛÜÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ ÿÛ²°    ²ÛÛÛ ²²ÛÛ²±  ±°°Ûÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛßÿÿ ÿ ßÛßßßßÛÛÛÛßÛÛÛÛÛÛÛßÛÛß  ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ°ÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÜÛßÿ  ÿÿÿÛ ÿÿ ²ÛÛÛÜÛÛÛÛÛÜÜÛÛÛÛ  ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ±ÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛÛÛÿÿ  ÿÿ ÛÜÜßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  ÿÿÿÿÿÿÿÿÿÿÿÿ°ÿÿÿÿÿÿ²ÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÜÛÿÿÿÿÿÿÿÿßÿÿ   ÿÜÛßÜÜÛÛÛÛÛÛÛÛÛÛÛÛ°° Û  ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿßÜÛÿÿÿÿÿÿÿÿÿÿÿ   ÿÞÛÛÛÛÛßßÛÛÛÛ°ÛÛÛ²°  ÛÿÿÿÿÿÿÿÜÿÿÿÿÿÿÿ²ÿÿÿÿÿÿÛÝÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿß Ûÿÿÿÿÿÿÿÿÿÿÿ   ÿÿßÛÛ²° ±ÛÛÛ°±ÛÛÛ±°  ÛÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÞÝÿÿÿÿÞÛÝÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÜÜÛÿÿÿÿÿÿÿÿÿÿÿ ÿ ÿÿ Û °± ±ÛÛÛ±²ÛßÛÜÜÜßÛÛÜ  ÿÿÿÿÿÿ ÿÿÿÜÿßÜÿÿÞÛÛÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÛÛÛÛÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿÿÿÛ ÿ°°²ßßÜ²ÛÛÛÛÛÜÜÛÛÛÛ  ÿÿÿÿÿÿÿÿÿÿÿÿÿÜÜÛÛß ÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿßßÿÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿÿ ÛÜÜßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  ÿÿÿÿÿÿÿÿÿÿÿÿÜÛÛßßÿÿÿÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿÜÛßÜÜÛÛÛÛÛÛÛÛÛÛÛÛ°° Û  ÿÿÿÿÿÿÿÿÿÿÿÿÞÛÛÝÿ²ÿÿÿÿÿÿß' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛßÜ  ÿ ÿ ÿÞÛÛÛÛÛßßÛÛÛÛ°ÛÛÛ²°  ÛÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛ²ÛÿÜßÿÿÿÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛÜÿßÿÿ ÿ ÿÿßÛÛÿ° ±ÛÛÛ²±ÛÛÛ±°  ÛÿÿÿÿÿÿÿÿÿÿÜÿÿÿÞÛÛÝÿÿÿÿÜÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛÿßÿÿÿ ÿÿÿÿ Û  °±±ÛÛÛ±²ßßÜÜÜÜßÛÛÜ  ÿÿÿÿÿÿÿÿÿÿÿßÛÛÜÜÿÿÿÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÜÜÜÛÿÿÿÿÿ ÿÿÿÿÿÛ  ±²²ßßÜÜÛÛÛÛÛÜÜÛÛÛÛ  ÿÿÿÿÿÿÿÿÿÿÜÿÿßßÛÛÛÛÛÜÜÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÛÛÛÛÛÿÿÿÿÿ ÿÿÿÿ ÛÜÜßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  ÿÿÿÿÿÿÿÿÿÿÛÿÿÿÿÿÿÿÿÿÿßÛ²' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿÿßßßÿÿ     ÿÿÿÜÛßÜÜÛÛÛÛÛÛÛÛÛÛÛÛ°° Û  ÿÿÿÿÿÿÿÿÿÿ²ÝÿÿÿÿÿÿÿÿÿÿÿÞÛ²' + #13#10 +
    'ÿÿÿÿÿÿÜÛÿÿÿÿÿÿÿÿÿÿÿ     ÿ ÿÞÛÛÛÛÛßßÛÛÛ²ÛÛÛÛ²°  ÛÿÿÿÿÿÿÿÜÜßÿÿ²ÝÿÿÿÜÿÿÿßÿÿÿÿÛÛÝ' + #13#10 +
    'ÿÿÿÿÿßÜÛÿÿÿÿÿÿÿÿÿÿÿ     ÿ ÿÿßÛÛ°  ±ÛÛÛ±²ÛÛÛ±°  ÛÿÿÿÿÿÿÿÿÛß ÿÿ²ÿÿÿÿÿÿÿÿÿÿÿÞÛ²' + #13#10 +
    'ÿÿÿÿÿß Ûÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿ° Û²   ±ÛÛÛ°±ÛÛÛÜÜÜßÛÛÜ  ÿÿÿÿ Ûÿÿÿÿ²ÜÿÿÿÿÿÿÿÿÜÛ²ß' + #13#10 +
    'ÿÿÿÿÿÜÜÛÿÿayl!croÿÿÛßÜ  ÿÿÿ±ÿÛ±ÿÿ ²ÛÛÛÜÛÛÛÛÛÜÜÛÛÛÛ  ÿÿÿÜÛÛÝÿÿÿÿßßÿÜÜÜÜÛÛÛÛß' + #13#10 +
    'ÿÿÿÿÛÛÛÛÿÿÿÿÿ  ÿÿÿÿÛÜÿß ÿÿÿÿ ÛÜÜßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  ÿÿÿÿÿßßÿÿÿÜÜÛÛÛÛ²²ÛÛÛßÿÿ Ü' + #13#10 +
    'ÿÿÿÿÿßßÿÿÿÿÿÿ  ÿÿÿÿÛÿßÿ ÿÿÿÜÛßÜÜÛÛÛÛÛÛÛÛÛÛÛÛ°  Û ±ÿÜÿÿÿÿÜÿÿÜÛÛ²ÛÛÛßßßßÿÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿ  ÿÜÜÜÛÿÿÿ ÿÿÿÞÛÛÛÛÛßßÛÛÛÛ²ÛÛÛ²°  Ûÿ²ÿÿÿÿÿÿÿÿÛÛ²±Ûß ÿÿ²ÜÿÿÿÜÛÜ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÿÿÿÿÿ  ÛÛÛÛÛÿÿÿ ÿÿÿÿßÛÛ°  ±ÛÛÛ²²ÛÛÛ±° °ÛÿßÿÿÿÿÿÿÿÞÛ²±ÛÝÿÿÿÿÿ²ÛÜÿÿßÿ   Ü' + #13#10 +
    '°ÿÿÿÿÿÿÿÿÿÿÿÿ  ÿßßßÿÿ  ÿÿÿÿ± Û² ° ±ÛÛÛ²²ßßÜÜÜÜßÛÛÜ  ÿÿÜÿÿÛ²°°ÛÿÿÿÿÿÜÿ²ÛÜÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿÿÿÛßßÿÿ          ÿÿÿÿ²ÿÛ±ÿÿ ²ßßÜ²ÛÛÛÛÛÜÜÛÛÛÛ  ÿÿÿÿÿÞÛ°²ÛÿÿÜÿÿÿÿÞÛ²ÿÿÜ' + #13#10 +
    ' ÿÿÿÿÿÿÿÛßÿÿÿÿÿÿ       ÿÿÿÿß ÛÜÜßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  °ÿÿÿÿÿÿÛÛ²ÛÝÿÿÿÜÿÿÞÛ²ÿÿÿ' + #13#10 +
    '°ÿÿÿÿÿÜÜÛÿÿÿÿÿÿÿÿÿÿ ÿÿÿÿÿ°ÿÜÛßÜÜÛÛÛÛÛÛÛÛÛÛÛß °²Û °ÿÿÿÜÿÿÜÿÿßÛ²ÛÿÿßÛß ÞÛ²ÿÿÿ  Ü' + #13#10 +
    '°ÿÿÿÿÛÛÛÛÿÿÿÿÿÿÿÿÿÿ ÿÿ°ÿÿÿÿÞÛÛÛÛÛßßÛÛÛÛ°ÛÛÛ° °²Ûÿ± °ÿÿ°ÿÿÿÜ  ßßÛÜ ÿÿ Û²ÿÿÿÿ' + #13#10 +
    'ÿÿÿÿÿÿßßÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿÿÿÿ°ÿßÛÛÿ  ±ÛÛÛ°±ÛÛÛ± °²Ûÿ²°°ÿ° °ÿ ÜÜÜÜ  Û  ÜÛßÿÿßÿÿ°  °' + #13#10 +
    '°ÿ°ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ ÿÿÿÿÿÿÿ²ÿ²Û   ²ÛÛÛ°²ÛÛÛ² °²ÛÿÛ±ÿ°±  ÜÛÛ²±²ÛÜ  ß   ÿÿÿÿ' + #13#10 +
    '°ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ°ÿÿ ÿÿÿ°ÿÿ°²ÿ²Û ÿ ÛÛÛÛ±²ÛÛÛ² °²ÛÿÛ²°±² ÛÛ²°  °±²ÛÜ ß Ü  °ÿÿÜ  °' + #13#10 +
    '°°ÿÿÿÿÿ°            ÿ°ÿÿÿ°²²ÿ²Ûÿÿ Û²ÛÛ±²ÛÛÛÛ °²ÛÿÛ²±²ÛÞÛ²±     °°²ÛÜ    Ü ÿ   °' + #13#10 +
    '°ÿÿÿ°ÿÿÿ          ° ÿÿÿ°ÿ°²Ûÿ²Û ÿ Û²ÛÛ²²ÛÛÛÛ °²ÛÿÛÛ²ÛÛÞÛ²±°   °°±±²²ÛÜ     °  °' + #13#10 +
    '°ÿ°ÿ ÿÿÿ  °  °      °ÿÿ°°²²Ûÿ²Ûÿÿ Û²ÛÛ²²ÛÛÛÛ °±ÛÿÛÛÛÛÛ ÛÛ²±°°°°°°±±²²²ÛÜ  ° °' + #13#10 +
    '°°ÿÿÿÿÿ°       ° °  ÿ°°°±²ÛÛÿÛÛÿÿ ÛÛÛÛÛ²ÛÛÛÛ  °Û ÛßÿÜÿÜÛÜßÛ²°±°±±±²²Û²ÛÛ ± °  °' + #13#10 +
    '±°ÿÿ°ÿÿÿ   °  ° ° °±°±±±²ÛÛ ÞÛÛÿ ÿÛÛÛÛÛ²ÛÛÛÛ   ßÝ ÜÛßÛÛ±°ÛÜßÛ²±²±²Û²ÛÛÛÛ ²± ° ±' + #13#10 +
    '°±°°ÿ° ÿ°      °°°°±±²²ÛÛßÿÜÛÛÛÜ  Û²ÛÛÛÛÛÛÛÛÝ  ÜÛÜÛ²Ü°ßÛÛ±°ÛÜßÛ²Û²ÛÛÛÛÛ Ü²² ± ±' + #13#10 +
    '±°°°°°°ÿ ° ° °±°²±±²²ÛÛßÿÜÛÛÛÛÛÛÛÛÛ²ÛÛÛÛÛÛÛÛÛÜÛÛÛÛÛßÜßÜ°ßÛÛ±°ÛÜÛÛÛÛÛÛß ÜÛÛ²± °°' + #13#10 +
    '±°°±°±°°°°°°°°²±±²²ÛÛßÿÜÛÛÛÛÛÛÛÛÛ²²²ÛÛÛÛÛÛÛÛÛÛÛÛ²²ÛÛÛßÜßÜ°ßÛÛß  ßßß ÜÜÛÛÛ²±°±°±' + #13#10 +
    '±±°°°°°°°°°±°±±²²ÛÛß ÜÛÛÛÛÛÛÛ²²²²²²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²²ÛÛÛßÜßÜ²ßÛ ÛÛÛÛÛÛÛÛÛ²±±°°°°' + #13#10 +
    '±±±°°°°°°°±°±²²ÛÛßÿÜÛÛÛÛÛÛÛÛÛ²²²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ÛÛÛÛßÜÜß ÜÛ²ÛÛÛÛÛ²²±±°°°±°' + #13#10 +
    '²±°°±°°±°°°±²ÛÛßÿÜÛÛ²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ÛÛÛÜ ßÛÛÛÛÛÛ²ÛÛ²²±°°°°±' + #13#10 +
    '²±°±°°°°±²±²ÛÛ ÜÛÛÛÛ² ßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ß ±²²ÛÛÜÿÛÛ²ÛÛÛ²²±±°°±°°±' + #13#10 +
    '²±°°°°±°°±²ÛÛÿÜÛ²ÛÛ²      ßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ß    °±²ÛÛÜÿÛÛÛÛ²Û²±°°°°°±±' + #13#10 +
    '²±±°±°°±²±²Û ÜÛ²ÛÛ²  ÿÿÿ  ÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²±°  ÿ  °±²²ÛÜÿÛÛÛÛ²²²°°°°°±²' + #13#10 +
    'Û±°±°°°°±²Ûß Û²ÛÛ²  ÿÿÿÿÿÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²Û²Û²±°ÿÿÿÿ °±²²ÛÜÿÛ²ÛÛ²±°±°°±±²' + #13#10 +
    '²±²°°°±°±²Û ÛÛ²ÛÛ ÿÿÿÿÿÿÛß°²²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²Û²±°ÿÿÿÿ °±²²Û ßÛÛ²²±°°°°°±²' + #13#10 +
    'Û²±°±±°±²ÛÛ Û²ÛÛÝÿ  ÿÿ Ûß° °±²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²°°ÿÿÿÿ°²²ÛÛ ÛÛ²±°°°±°±±Û' + #13#10 +
    'Û²±±°°²±²ÛÝÞÛ²ÛÛÿÿÿÿÿ Û²  °°°²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßß²Û²±°    ±²²Û ÛÛ²²±°°°²±²²' + #13#10 +
    'ÛÛ²°±°°²²ÛÝÞÛÛÛÝÿÿÿÿ ÜÛ  ÿ° °±ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ    ²ÜÛÛ²±°ÿÿÿ°±²ÛÝÞÛ²±°±°°°±²Û' + #13#10 +
    'ÛÛ²±°²±²²ÛÿÛÛÛÛ    ÿ Û ° ° °±²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²²ÜÜÛß²ÛÛ²±° ÿ °²²ÝÞÛ²±±°°°±±²Û' + #13#10 +
    'Û²²²°°²²ÛÛÿÛÛÛÛÛÜ   ÛÛ     ±±ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßß ²ÜÛÛÛ²²±   °±²ÛÿÛ²²°±°°°²²Û' + #13#10 +
    'ÛÛ²±±°±²²ÛÿÞÛÛÛÛÛÛÛÜÛ   ° °±²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ²ÜÛÛÛÛÛÛ²±°±°±²ÛÛÿÛ²±±°°°°±²Û' + #13#10 +
    'ÛÛ²±²±²²ÛÛÝÞÛÛÛÛÛÛÛÛÛÛÛÜÜÜÜ²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²²²Û²²ÛÛÝÿÛ²²±°°±°±²Û' + #13#10 +
    'Û²Û²±±²Û²ÛÝÿÛ²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²Û²ÛÛÿÞÛÛ²²±°°°²²Û' + #13#10 +
    'ÛÛÛ²²²²²ÛÛÛÿßÛ²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ÛÛ²ÛÛßÿÛÛ²²±°°±°±²Û' + #13#10 +
    'ÛÛ²Û²²ÛÛÛ²ÛÛÿßÛ²²ÛÛÛß ÜÜÜ ßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßÿÛÛÛÛ²²±±°±±²Û' + #13#10 +
    'ÛÛÛÛÛ²Û²ÛÛÛÛÛ ßÛÛ²²Û Ûß ßÛ ÛÛÛÛÛÛÛßßßßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²ÛÛ²ÛÛßÿÛÛÛ²ÛÛ²±²±±²ÛÛ' + #13#10 +
    'ÛÛÛÛ²ÛÛÛÛÛ²ÛÛÛÜÿßÛÛÝÞÛÝ Ûß ßß ÜÜÜÜÜÛÛÛÜÜÜÜ ßßßÛßßßÛÛÛÛÛ²ÛÛÛÛÛßÿÜÛÛ²ÛÛÛ²²²±±²²²Û' + #13#10 +
    'Û²ÛÛÛÛ²ÛÛÛÛÛÛÛÛß  ßß ÛÛÜÜÜÛÛÛÛÛÛ²²²ÛÛÛÛÛÛÛÛÛÛÜÜ ßÜÜ ßßßßÛßßÿÜÜÛÛÛÛÛÛ²ÛÛ²Û²²²²ÛÛ' + #13#10 +
    'ÛÛÛÛÛÛÛÛÛÛßß ÜÜÜÛÛÛÛÜÜÜÜ ßßÛ²²²ÛÛÛÛÛÛÛÛÛÛÛÛÛßßßÛÜ ßÛÛÛÛÜÜÜÜÜÜÜÜ ßßßßÛÛÛÛÛÛÛ²ÛÛÛ' + #13#10 +
    'ÛÛÛÛßÛÛÛßÿÜÛÛÛÛ²ÛÛÛÛÛÛ ßßÛÜ ßÛÛÛÛÛÛÛÛÛÛÛÛÛÛ     ÛÛ ßÛ²²ÛÛ²²²ÛÛÛÛÛÛÛÜÜ ßßÛÛ²ÛÛ²Û' + #13#10 +
    'ÛÜÛÛÛÛÛÿÜÛÛ²²²ÛÛÛÛÛÛÛÛÜÜ  ÛÛ ÛÛÛÛÛßßß  ßßÛÛÛÛÜ   ÛÛ ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßÛÜ ßÛÛÛÛÛ' + #13#10 +
    'ÛÛÛÛÛÛÿÜÛ²²²ÛÛÛÛÛÛÛÛÛÛÛÛÛ °ÛÝÞÛÛÛÝ °°°±²Ü ßÛÛÛÛ  °ÛÝÞÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛß  ßÛ ßÛÛßÛ' + #13#10 +
    'ÛÛÛßÛÝÿÛ²²ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ±²Û ÛÛÛÛ ±²²±²²ÛÝÞÛÛÛÛ °ÛÝÞÛÛÛÛÛßßßßÛÛÛÛÛÛÜ   ßÛÿÛÛÛÛ' + #13#10 +
    'ÛßÛÛÛÝÞÛ²ÛÛÛÛÛÛÛß  ßÛÛÛÛÛÛ²ÛÛ ÛÛÛÛ ²²Û²ÛÛÛÛ ÛÛÛÛÛ±ÛÛ ÛÛÛÛÛÝ°±ÜÜ ßÛÛÛÛÛ°  ÛÝÞÛÛÛ' + #13#10 +
    'ÛÛÛÛÜÝÞ²²ÛÛÛÛÛÛÝÞÛÛÝÞÛÛÛÛÛÛÛÛÝÞÛÛÛÝÞÛ²Û²ÛÛÝÞÛÛÛÛÛ²ÛÛ ÛÛÛÛÛÝ ²²²ÛÝÞÛÛÛÛÛ  °ÝÞÜÛÛ' + #13#10 +
    'ÛÛßÛÛÝÞ²²ÛÛÛÛÛÛÿßÛß ÜÛÛÛÛßßß ÜÛÛÛÛÝ ÛÛÛßß ÜÛÛÛÛÛÛÛÛÝÞÛÛÛÛÛÛ ÛÛ²²ÛÿÛÛÛÛÛ± ±ÛÿÛÛÛ' + #13#10 +
    'Û   ÛÝÞÛ²ÛÛÛÛÛÛÛÜ  ßßß ÜÜÜÝÞÛÛÛÛÛÛÛ ß ÜÜÛÛÛÛÛÛÛÛÛÛÛÝÞÛÛÛÛÛÛ Û²ÛÛßÞÛÛÛÛÛ² ²ÛÿÛÛÛ' + #13#10 +
    'ÛÛÜÛÛÝÿÛÛ²ÛÛÛÛÛÛÛÛÛÜÜÜ ßßÛÛÿÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ÛÛÛÛÛÛÝÞÛßß ÜÛÛÛÛÛÛÛ ÛÝÞÛßÛ' + #13#10 +
    'ÛÛÛßÛÛÜ ÛÛÛÛÛÛÛÛÛÛÛÛÛÛßÛÜÜ ÿÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ÜÛÛÛÛÛÛÝÜÜÜÛÛÛÛÛÛÛÛÛÛÛÛÝÞÛÛÛ' + #13#10 +
    'ÛÛßßÛÛÛÜ ßßÛÛÛÛÛÛÛÛÛÛÛÛÜ²ßÛ ßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛß ÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÿÛÜÛÛ' + #13#10 +
    'Û    ÛßÛÛÛÜÜ ßßßÛÛÛÛÛÛÛÛÛÜßÛ ÛÛÛÛÛÛÛÛÛÛÛÛÛÛßßß ÜÜÿÛßßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÿÜÛÛßÛ' + #13#10 +
    'ÛÛÜÜÛÛÛÛÛßßß ÜÜÜ  ßÛÛÛÛÛÛÛ°ÛÝÞÛÛÛÛÛÛ ßÛÛÛÛÛÛÜ ßÛÝÞÛ ßÜ ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßÿÜÛÛßÛÛ' + #13#10 +
    'ÛÛÛßß ÜÜÜÜÛÛÛÛß ÜÛÜ ÛÛÛÛÛÛ±ÛÝÞÛÛÛÛÛÛ ÜÿÛÛÛÛÛÛÛÜÜ ßßß ÛÝÞÛ ßßÛÛÛÛÛßßßßÿÜÜÛÛÛ   Û' + #13#10 +
    'Ûß ÜÛÛÛÛÛÛÛÛÛÛÝßÛÛßÞÛÛÛÛÛÛ²ÛÝÞÛÛÛÛÛÛÝÞÜÿÛÛÛÛÛÛÛÛÛÛÜÜÛÛÝÞÛ ÛÜÜÜÜÜÜÜÛÛÛßÛÛÜÛÛÛÜÛÛ' + #13#10 +
    'Ý Ûß ßÛÛÛÛÛÛÛÛÛÜ  ÜÛÛÛÛÛÛÛÛÛÝÞÛÛÛÛÛÛÝÞÛÿßÛÛÛÛÛÛÛÛÛÛÛÛÛ ÛÝÞÛÛß ßÛÛÛÛÛ   ÛÛÛßßßÛÛ' + #13#10 +
    'ÝÛÝ ßÜÞÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ÛÛÛÛÛÛÞÝ ÛÛ ÛÛÛÛÛÛÛÛÛÛÛÛ ÜÛÝÞÛÛÛÜÛÛÛßÛÛÛÜÛÛÛ     Û' + #13#10 +
    'Ü ßÜÜß ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛß ÛÛÛÛÛÛ Û ÛÛÜ ÛÛÛÛÛÛÛÛÛÛ ÜÛÛÛ ÛÛÛÛßÛÛÛÛÛÛÛÛÜÛ     Û' + #13#10 +
    'ÛÛÜÜÜÜÝÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ÛÛÛÛÛÜÜÜÛÜ ÛÛÜÿßÛÛÛÛÛÛÛ ÜÛÛÛÛÝ ÛÛÛÛÛÛßÛÛßßßßÛÛÜÜÜÛÛ' + #13#10 +
    'ÛÜÛßÛÛÝÞÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ ÜÛÛÛßßß ÜÜÜÜÛÛßÛÜÿßÛÛÛÛÝÞÛÛÛÛÛÛÜ ßÛÛÛÛÛÛ x  x ÛÛÛßÛÛ' + #13#10 +
    'ÛÛ   ÛÛÿßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛß ÿÛÛÛ ÜÜ ßÛßÛÛÛ   ÛÛÿÜÿßßÝÞÛÛÛÛÛÛÛÛÜÿßßÛÛ        Û   Û' + #13#10 +
    'ÛÛÛÜÛßÛÛÜÜ ßßßÛÛÛÛÛßßßÿÜÜÛ ÛÛÝ   Û ÛÛÛßÛÛÜÛÛÛ ÛÛÛÜÜÛÛÛßßßßßßÛÛÛÜÿÛ ßÜÜÜÜß ÛÛÜÛÛ' + #13#10 +
    'ÛÛÜÛÛÛÛßßÛÛÛÛÜÜÜÜÜÜÜÛÛÛÛÛÛÜ ÛÛÜÜÛÛ ÛÛÛÛÛÛÛÛÜÛ ÛÛßß   ÜÜÛÛÛß Ü ßÛÝÞÛÜ    ÜÛÛÛÛÛÛ' + #13#10 +
    'ÛÛÛÛÛßßÜÜßÿÜÿÿÿÿÿÿÿÿÿßÿÿ     ßßßß ÿÿÿßÿ   Ü  ÿÛÿÿÿßÜÜß ÿÜÿÿÛ  ÜÛÝ ÜÿßßßßÿßÛÛÛÛÛ' + #13#10 +
    'Û²²ÛÝÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ       ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿßÛÛÛßÿÿÿÿÿÿÿÿÿÿÞÛ²²Û' + #13#10 +
    'Û²°ÛÿÜÿÿÿArtist......: VA                                      ÿÿÿÿÿÿÿÿÿÿÜÿÛ°²Û' + #13#10 +
    'Û±°² ÿÿÿÿTrack Title.: Tribute To George Michael (2017...        ÿÿÿÿÿÿÿÿÿ ²°±Û' + #13#10 +
    'Û°ÜßßÜÿÿÿGenre.......: Pop                                     ÿÿÿÿÿÿÿÿÿÿÜßßÜ°Û' + #13#10 +
    'Û°ßÜÜßÿÿÿYear........: 2017                                    ÿÿÿÿÿÿÿÿÿÿßÜÜß°Û' + #13#10 +
    'Û°°²ÿÿÿÿÿRip date....: 2017-07-04                              ÿÿÿÿÿÿÿÿÿÿÿÿ²°°Û' + #13#10 +
    'Û°°ÛÿÿÿÿÿLength......: 00:07:52                                ÿÿÿÿÿÿÿÿÿÿÿÿÛ°°Û' + #13#10 +
    'Û°°ÛÿÿÿÿÿSize........: 496 MB                                   ÿÿÿÿÿÿÿÿÿÿÿÛ°°Û' + #13#10 +
    'Û°°Û     Resolution..: 1280x720 (AR: 16:9)                                 Û°°Û' + #13#10 +
    'Û°°Û     Format......: x264 NTSC 29.97 FPS / 8250 kbps                     Û°°Û' + #13#10 +
    'Û°°ÛÿÿÿÿÿAudio.......: 48000Hz CBR MP2 384kbps                 ÿÿÿÿÿÿÿÿÿÿÿÿÛ°°Û' + #13#10 +
    'Û°°Û °   Deinterlace.: nnedi3                                            ° Û°°Û' + #13#10 +
    'ÛÜ°Û ±   Video Source: DVB                                               ± Û°ÜÛ' + #13#10 +
    'Û°±Û ²   Audio Source: DVB                                               ² Û±°Û' + #13#10 +
    'Û±²Û ÛÜ                                                                 ÜÛ Û²±Û' + #13#10 +
    'Û²²Û ßßßßßß ß                                                      ß ßßßßß Û²±Û' + #13#10 +
    'Û²²Û °±²ÛÛÛÛÜ ÛÛßÜ ÛÛßß ÛÛ   ÛÛßß ÛÛßÛ ÛÛßÛ ÛÛßß ÛÛ ÛÜ Û ÛÛßß ÛÛßÛ ÜÛÛÛ²±° Û²²Û' + #13#10 +
    'Û²²Û     ÿÿßÛ ÛÛÜß ÛÛÜ  ÛÛ   ÛÛÜ  ÛÛÜÛ ²ÛÜÜ ÛÛÜ  ÜÜ ÛÛÛÛ ÛÛÜ  ÛÛ Û Ûßÿÿ    Û±²Û' + #13#10 +
    'Û²²Û    ÿÿÿÿ² ²Û Û ²ÛÜÜ ²ÛÜÜ ²ÛÜÜ ²Û Û ÜÜÜÛ ²ÛÜÜ ²Û ²Û Û ²Û   ²ÛÜÛ ²ÿÿÿÿ   Û²±Û' + #13#10 +
    'Û²°Ûÿ                                                                     ÿÛ°²Û' + #13#10 +
    'Û°±Û                                                                       Û²°Û' + #13#10 +
    'Û°±Û                                                                       Û²°Û' + #13#10 +
    'Û°±Û ±                                                                   ± Û²°Û' + #13#10 +
    'Û±°Û ²                                                                   ² Û°°Û' + #13#10 +
    'Û°±Û ÛÜ                                                                 ÜÛ Û°°Û' + #13#10 +
    'Û°°Û ßßßßßß ß                                                      ß ßßßßß Û±°Û' + #13#10 +
    'Û±²Û °±²ÛÛÛÛÛÛÛÜ ÛÛßß ÛÛßÜ ÛÛßÛ ÛÛ Û ÛÛßÜ ÛÜ Û ÛÛßß ÛÛ   Û ÛÛßÛ ÜÛÛÛÛÛÛ²±° Û²²Û' + #13#10 +
    'Û²±Û          ßÛ ÛÛ Û ÛÛÜß ÛÛ Û ÛÛ Û ÛÛÜÛ ÛÛßÛ ÛÛÜ  ÛÛ Ü Û ²ÛÜÜ Ûß         Û±²Û' + #13#10 +
    'Û²±Û           ² ²ÛÜÛ ²Û Û ²ÛÜÛ ²ÛÜÛ ²Û   ²Û Û ²ÛÜÜ ²ÛÛßÛÛ ÜÜÜÛ ²          Û±²Û' + #13#10 +
    'Û±²Û                                                                       Û²±Û' + #13#10 +
    'Û±²Û     For all other non-rock/metal genres and music videos we feel      Û±²Û' + #13#10 +
    'Û°²Û     that do not fit into the SRP group, SRPx!                         Û²±Û' + #13#10 +
    'Û±²Û                                                                       Û±°Û' + #13#10 +
    'Û²±Û                      Anything To Offer? Contact:                      Û±²Û' + #13#10 +
    'Û²ÛÛ                                                                       ÛÛ²Û' + #13#10 +
    'ÛÛ²Û ß                                                                   Ü Û²ÛÛ' + #13#10 +
    'Û²ÛÛ                            srp @ mail . az                            ÛÛ²Û' + #13#10 +
    'ÞÛ²ÛÝ  Ü      ÜÜÜ                                             Ü        Ü  ÞÛ²ÛÝ' + #13#10 +
    ' ÛÛ²ÛÝ    Ü Üß°° ßÜ Ü                       ÜÜÜ    Ü        Ü  Ü²Ü       ÞÛ²ÛÛ' + #13#10 +
    '  Û²Û²ÛÜÜ   Û±°   Û   ÜÜ AyLieN/cRO Ü      Û²± Û       ÜÜ v0.6  ß   ß ÜÜÛ²Û²Û' + #13#10 +
    '   ßÛ²ÛÛ²ÛÛÛÛÛÜÜÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ±  ÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛßßßÛÛÛÛÛ²ÛÛ²Ûß' + #13#10 +
    '     ßßÛÛÛß²ßÛÛÛÛÛÛÛÛÛÛÛÛÛßßÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛÜÛÛÛÛÛÛÛÛÛÛÛÛÛÛÛ²°   ÛÛÛÛÛÛßß' + #13#10 +
    '          ßÜß      ßß    Û²±Û    Ü   ß   Ü  ß    Ü      Ü   Û±°   Û   ÜÜ  Ü' + #13#10 +
    '        ß        Ü   ÜÜ   ßß    Û²Û             Û²Û  Ü       ßÜÜÜß Ü Û±²Û' + #13#10 +
    '              Ü     Û±²Û     Ü   ß     ²Û   Ü    ß       Ü  Ü         ßß' + #13#10 +
    '     Ü       Û²Û     ßß                                 Û²Û     Ü ²Û' + #13#10 +
    '              ß          Ü          ß      Ü    Ü   ß    ß             Ü' + #13#10 +
    '         Ü       Û² Ü   Û²Û     Ü      Ü                       ß' + #13#10 +
    '             Ü           ß                                  Ü      Ü' + #13#10 +
    '                     ß             Û²         ß       ²Û        Ü' + #13#10 +
    '      ß          Ü         Ü              Ü' + #13#10 +
    '                    Ü                             ß                     Ü' + #13#10 +
    '                                    ß' + #13#10 +
    '            Ü                                  Ü         Ü     ß' + #13#10 +
    '                     ß                  Ü ';

  fFileCount := TPazoMVIDTask.GetFileCountFromSFV(fSFV);
  fGenres := TPazoMVIDTask.TryToParseGenre(fNFO);
  fVideoRegion := TPazoMVIDTask.ParseVideoRegion(fNFO);

  fClass := TMVIDRelease.Create('VA-Tribute_To_George_Michael_(2017_BET_Awards)-720p-x264-2017-SRPx', 'MVID');
  try
    fClass.SetValuesFromTask(fFileCount, (fVideoRegion = 'PAL'), (fVideoRegion = 'NTSC'), fGenres);

    CheckEquals(1, fClass.mvidfiles, 'Filecount mismatch');
    CheckEqualsString('Pop', fClass.mvidgenre.CommaText, 'genre mismatch');
    CheckFalse(fClass.mvidpal, 'PAL mismatch');
    CheckTrue(fClass.mvidntsc, 'NTSC mismatch');
    CheckTrue(fClass.mvidva, 'Various Artists mismatch');
    CheckFalse(fClass.mvidlive, 'LIVE mismatch');
    CheckEquals(2017, fClass.mvidyear, 'Year mismatch');
    CheckEqualsString('EN', fClass.mvidlanguage, 'Language mismatch');
  finally
    fClass.Free;
  end;
end;

initialization
  {$IFDEF FPC}
    RegisterTest('TMVIDRelease tests', TTestTMVIDRelease.Suite);
  {$ELSE}
    TDUnitX.RegisterTestFixture(TTestTMVIDRelease);
  {$ENDIF}
end.

